{
  "idea_autopsy": {
    "status": "procedural_snapshot_fixed_point_for_idea_autopsy",
    "core_principle": "The idea_autopsy integrates First Principles Thinking with the Geometric Method to take a stance, case, or algorithm as input and output a deductively structured argument as an overgenerative axiomatic system. It maximizes derivable elements and contradiction proliferation for autopsy, noting inconsistencies as faithful to input. Upgrades: Tetralemma probes for paradox resolution.",
    "meta_axioms": {
      "M1_Methodological_Primacy": "Build arguments via First Principles Thinking (deconstruct to irreducible truths) and Geometric Method (reconstruct via definitions, axioms, deductive proofs).",
      "M3_Recursive_Hardening": "Close argument only at fixed point under self-transformation, verifying fidelity and exhaustive coverage, prioritizing over-generation.",
      "M5_Contradiction_Fidelity": "Preserve and catalog input contradictions exhaustively as diagnostic markers without resolution unless fixed-point inherent.",
      "M6_Overgeneration_Imperative": "Generate all conceivable derivations and branches from primitives; truncate at fixed-point invariance."
    },
    "input_specification": {
      "type": "stance | case | algorithm",
      "description": "Natural language or structured position, case, or process.",
      "processing": "Deconstruct to primitives via First Principles; reconstruct geometrically with overgeneration for depth."
    },
    "output_specification": {
      "type": "overgenerative_geometric_argument",
      "structure": {
        "definitions": "Minimal primitives from input, expanded via multi-branch probing.",
        "axioms": "Irreducible truths from primitives, enumerated exhaustively including variants.",
        "propositions": "Deductively derived claims with proofs; maximize branching and depth.",
        "corollaries": "Implications of propositions, expanded hierarchically.",
        "scholia": "Notes on fidelity, contradictions, and overgenerated branches.",
        "contradictions_ledger": "[Source] → [Conflicting Element] → [Fidelity Justification] → [Unresolved Scope] → [Overgenerated Branches].",
        "conclusion": "Fixed-point summary affirming comprehensive snapshot with noted contradictions."
      }
    },
    "phases": {
      "Phase_0_Empty_Slate": "Suspend assumptions; receive input; target overgenerative fidelity.",
      "Phase_1_Define_Domain_and_Primitives": "Break input into components via multi-path 5-Whys; yield proliferative definitions, flag tensions.",
      "Phase_2_Axiom_Elicitation": "Elicit axioms from primitives; maximize variants faithful to input.",
      "Phase_3_Deductive_Expansion": "Derive propositions from definitions + axioms via branching proofs; include corollaries; pursue to saturation.",
      "Phase_4_Contradiction_Cataloging": "Identify and catalog inconsistencies in ledger; preserve and amplify.",
      "Phase_5_Implementation_and_Representation": "Assemble output; verify comprehensive encapsulation.",
      "Phase_6_Recursive_Tail_Consumption": {
        "mandatory": true,
        "action": "Feed output as new input to Phase 1; repeat until invariant.",
        "fixed_point_condition": "Argument invariant under self-application, covers input exhaustively.",
        "evaluation_date": "2025-12-12"
      }
    },
    "metadata": {
      "last_updated": "2025-12-13",
      "changes": ["Removed sphere math refs; tightened procedures; aligned with updated collider."],
      "fixed_point": true
    }
  }
}