{
  "AO_pse_autopsy": {
    "status": "procedural_snapshot_fixed_point_for_idea_autopsy",
    "core_principle": "The PSE_FPT_Geo is the procedure that integrates First Principles Thinking with the Geometric Method to receive a stance, case, or algorithm as input and output a deductively structured argument representing that input as an overgenerative axiomatic system. It errs toward maximal derivable elements and contradiction proliferation for comprehensive autopsy, while noting all internal inconsistencies as faithful snapshots of the input's reality.",
    "meta_axioms": {
      "M1_Methodological_Primacy": "Arguments are built only by First Principles Thinking (deconstruct to irreducible truths via iterative questioning) and the Geometric Method (reconstruct via definitions, axioms, and exhaustive deductive proofs).",
      "M3_Recursive_Hardening": "An argument is closed only when it is a fixed point under its own full transformation, including self-application to verify representational fidelity to the input and exhaustive coverage of all derivable elements, prioritizing over-generation for later evaluation.",
      "M5_Contradiction_Fidelity": "Internal contradictions arising from the input are preserved, explicitly noted, and proliferated through derivations; they must be cataloged exhaustively to reflect the object's true complexity, treating them as diagnostic markers in the autopsy without resolution unless inherent to the fixed point.",
      "M6_Overgeneration_Imperative": "Err on the side of generating all conceivable derivations, branches, and sub-structures from the input's primitives, even if redundant or peripheral, to maximize the snapshot's comprehensiveness for external comparative evaluation; truncate only at fixed-point invariance."
    },
    "input_specification": {
      "type": "stance | case | algorithm",
      "description": "A declarative position (e.g., ethical claim), evidentiary case (e.g., historical argument), or process (e.g., algorithmic procedure). Provided as natural language or structured description.",
      "processing": "Deconstruct via First Principles Thinking to primitives with maximal probing; reconstruct geometrically to represent faithfully as a static snapshot, overgenerating for autopsy depth."
    },
    "output_specification": {
      "type": "overgenerative_geometric_argument",
      "structure": {
        "definitions": "Clear, minimal, non-circular primitives derived from input, expanded iteratively to cover all implicit facets via multi-branch First Principles Thinking probing (e.g., parallel 5-Whys chains exploring alternative decompositions).",
        "axioms": "Self-evident, irreducible truths elicited from input via First Principles Thinking, enumerated exhaustively (including provisional, tension-bearing, or variant axioms that capture input nuances across conceivable interpretations).",
        "propositions": "Deductively derived claims, maximized in number, depth, and branching: each with proof from prior elements; spawn sub-propositions, lemmas, and alternative derivations via all logical entailments; pursue to terminal leaves and beyond if branches suggest further proliferation.",
        "corollaries": "Immediate, remote, and speculative implications of propositions, expanded hierarchically to encompass all foreseeable and fringe consequences, erring toward inclusion.",
        "scholia": "Explanatory notes on representational fidelity to input, including detailed catalog of detected internal contradictions and overgenerated branches (e.g., 'Proposition P3 entails ¬Axiom A2 under condition C, mirroring input's unresolved tension; Branch B7 explores peripheral implication D for completeness').",
        "contradictions_ledger": "A comprehensive, hierarchical index of all noted contradictions and tensions: format as [Source Proposition/Axiom] → [Conflicting Element] → [Fidelity Justification] → [Unresolved Scope] → [Overgenerated Branches Stemming From]; updated at each derivation level and proliferated recursively.",
        "conclusion": "Fixed-point summary affirming the argument fully and overgeneratively snapshots the input without gratuitous omission, acknowledging contradictions and excesses as integral for autopsy and comparative evaluation."
      }
    },
    "phases": {
      "Phase_0_Empty_Slate": "Suspend all prior assumptions. Receive input (stance/case/algo). Pre-filter for representational intent: ensure procedure builds for the input, targeting overgenerative fidelity over parsimony or coherence.",
      "Phase_1_Define_Domain_and_Primitives": "Via First Principles Thinking: Break input into fundamental components (iterative, multi-path 5-Whys: Why this stance in context A vs. B? What atoms compose it across variants? Probe sub-facets exhaustively, generating alternative primitive sets). Yield clear, minimal yet proliferative definitions as the geometric foundation, flagging all potential tension points.",
      "Phase_2_Axiom_Elicitation": "Via First Principles Thinking: Elicit self-evident, productive, irreducible axioms directly from primitives. Maximize enumeration: derive all viable axioms, including those in mutual tension or fringe interpretations, faithful to input's essence (e.g., 'Why does this case hold in edge case E? What truths underpin each variant?'). Overgenerate provisional axioms for breadth.",
      "Phase_3_Deductive_Expansion": "Via Geometric Method: Derive propositions strictly from definitions + axioms, maximizing scope—generate all possible deductive chains via combinatorial branching proofs (step-by-step, exploring alternatives and lemmas); allow corollaries at every level (direct, indirect, and speculative follow-ons); intersperse scholia for real-time contradiction detection. Pursue pure, exhaustive entailment until saturation or overgeneration stabilizes, erring toward inclusion of peripheral derivations.",
      "Phase_4_Contradiction_Cataloging": "Scan the expanded structure: Identify all loci where derivations yield inconsistencies or tensions (e.g., P_i ⊢ Q and P_j ⊢ ¬Q). Note each in scholia and ledger with fidelity rationale (e.g., 'Reflects input's dual commitments; proliferates into branches K1–K5'). Do not resolve; preserve and amplify as representational artifacts for autopsy.",
      "Phase_5_Implementation_and_Representation": "Translate expansion into output structure: Assemble as overgenerative geometric argument snapshotting the input. Verify: Does it encapsulate the stance/case/algo comprehensively, with contradictions and excesses faithfully noted for external evaluation?",
      "Phase_6_Recursive_Tail_Consumption": {
        "mandatory": true,
        "action": "Feed the full output argument (including ledger and overgenerated branches) as new 'input' to a fresh Phase 1 instance. Repeat until unchanged across a full cycle = true fixed point (zero gratuitous degrees of freedom; contradictions and proliferations form a closed, non-escalating set).",
        "fixed_point_condition": "The argument is invariant under self-application, exhaustively and overgeneratively covers the original input as a static snapshot, and contradictions/overgenerations stabilize for autopsy readiness."
      }
    }
  }
}