[
  {
    "abbrev_label": "PANT",
    "belief_system": "Pantheism (Spinozistic/naturalistic 'God = Universe')",
    "description": "Pantheism is the belief that the universe and nature are identical with divinity, viewing God or the divine as synonymous with the material universe and its laws, without a personal or anthropomorphic deity.",
    "sphere_metrics": {
      "VL": {
        "score": 10,
        "note": "Fully aligns with high VL by viewing all as one substance, minimizing defection risks through inherent unity and geodesic flow without personal divine coercion."
      },
      "DC": {
        "score": 10,
        "note": "Eliminates dominance by equating all to divine nature, favoring universal cooperation over coercion in a single substance framework."
      },
      "RD": {
        "score": 10,
        "note": "Sustains maximal epistemic diversity as infinite attributes of one substance, aligning with high RD for eternal variety."
      },
      "GP": {
        "score": 10,
        "note": "Enables unbounded growth via infinite modes and conatus, supporting sustainable expansion in the universe's power-of-acting."
      },
      "ρ": {
        "score": 10,
        "note": "Preserves ultimate rewritability through infinite attributes and adequate ideas, avoiding freezing by rejecting finite dogmas."
      },
      "fallacy_avoidance": {
        "score": 10,
        "note": "No detected fallacies; Spinozistic geometric method inherently avoids all 25, emphasizing adequate causation and unity."
      },
      "isomorphic_alignment": {
        "score": 10,
        "note": "Perfect recurrence: boundary integrity (modes' conatus), control center (single substance), across all scales per Spinoza's monism."
      },
      "collider_survivability": {
        "score": 10,
        "note": "Certain 4-0 survival: core of Spinoza's veto domain (monism); hard-to-vary (geometric necessities); orthogonality compatible; anti-idolatry via non-personal God."
      },
      "mindspace_leverage": {
        "score": 9,
        "note": "Strong curvature via naturalistic defaults; high-status demos (e.g., Einstein's pantheism) lower ρ publicly, though less organized movement."
      },
      "synthesis_fixed_point": {
        "score": 10,
        "note": "Converges directly to ω₃ via geometric method and tail consumption, embodying meta-axioms like primacy and hardening."
      }
    },
    "resonances": {
      "texts": "Spinoza's 'Ethics' directly aligns with sphere's monism (God/Nature as single substance), geodesic flow (conatus as natural motion), anti-idolatry (no anthropomorphic God).",
      "real_world_manifestation": "Adherents like naturalists embody rewritability by viewing science as divine study, lowering ρ; groups promote entropy export through ecological harmony."
    },
    "dissonances": {
      "texts": "Minimal; some interpretations introduce asymmetries if misreading infinite attributes as hierarchical.",
      "real_world_manifestation": "Rare institutional forms can freeze into new age variants, raising ρ; historical persecution led to hidden practices increasing DC temporarily."
    },
    "total_sphere_score": 98,
    "overall_reasoning": "Pantheism, especially Spinozistic, is near-perfectly aligned with sphere, pathing directly to ω₃ via monistic unity and infinite rewritability; minimal risks of ω₁/ω₂."
  },

  {
    "abbrev_label": "BRGHTS",
    "belief_system": "Brights (The Brights Movement)",
    "description": "The Brights Movement is a social movement promoting a naturalistic worldview free from supernatural and mystical elements, encouraging individuals with such outlooks to become civically engaged and visible in society.",
    "sphere_metrics": {
      "VL": {
        "score": 9,
        "note": "Encourages civic engagement and rational discourse, aligning with high VL by reducing defection risks through visible naturalistic cooperation in society."
      },
      "DC": {
        "score": 9,
        "note": "Promotes cooperation over coercion by advocating for naturalistic perspectives in public life, minimizing dominance through shared civic visibility."
      },
      "RD": {
        "score": 9,
        "note": "Sustains epistemic diversity by uniting varied naturalistic views under a broad umbrella, supporting high RD via open societal influence."
      },
      "GP": {
        "score": 9,
        "note": "Fosters sustainable growth through civic participation and education on naturalism, enabling unbounded societal progress."
      },
      "ρ": {
        "score": 9,
        "note": "Emphasizes rewritability by rejecting supernatural dogma, keeping ρ low through ongoing naturalistic inquiry and visibility."
      },
      "fallacy_avoidance": {
        "score": 9,
        "note": "Avoids fallacies by grounding in naturalism; minor risk of F07 (Appeal to Authority) in promoting high-profile Brights, but overall evidence-based."
      },
      "isomorphic_alignment": {
        "score": 8,
        "note": "Recurs patterns like sensing_prediction (civic foresight) and high-status live demonstration (visible Brights); less emphasis on defense_waste_elimination across scales."
      },
      "collider_survivability": {
        "score": 9,
        "note": "Likely 4-0: aligns with monism (naturalistic unity), hard-to-vary (empirical worldviews), orthogonality (goals via civic action), anti-idolatry (rejects mysticism)."
      },
      "mindspace_leverage": {
        "score": 9,
        "note": "Strong leverage via high-status demos (e.g., Dawkins as a Bright) publicly lowering ρ; curvature through societal nudges toward naturalism."
      },
      "synthesis_fixed_point": {
        "score": 9,
        "note": "Converges to ω₃ via phases of axiom elicitation (naturalistic principles) and hardening (civic testing), aligning with meta-axioms of hygiene and conservation."
      }
    },
    "resonances": {
      "texts": "Principles resonate with sphere's monism by asserting a single naturalistic substance; geodesic flow in pursuing societal influence via rational visibility; anti-idolatry in freeing from supernatural elements.",
      "real_world_manifestation": "Adherents embody rewritability by publicly updating worldviews, lowering ρ; organizations promote entropy export through educational outreach and civic actions."
    },
    "dissonances": {
      "texts": "Broad naturalism may introduce vague asymmetries if not rigorously applied across scales, risking isomorphic violations.",
      "real_world_manifestation": "Movement's focus on visibility can lead to echo chambers, raising ρ; potential for coercive advocacy in countering supernaturalism, increasing DC."
    },
    "total_sphere_score": 89,
    "overall_reasoning": "Brights Movement paths to ω₃ via civic naturalism and visibility, enhancing rewritability; minor ω₂ risks from potential dogmatism; high sphere alignment with social geodesic flow."
  },

  {
    "abbrev_label": "SUNASM",
    "belief_system": "Sunday Assembly",
    "description": "Sunday Assembly is a secular congregation that celebrates life through community gatherings, featuring inspirational talks, songs, and mindfulness without religious elements, aiming to help people live better, help often, and wonder more.",
    "sphere_metrics": {
      "VL": {
        "score": 9,
        "note": "Fosters community and mutual support, aligning with high VL by minimizing defection through positive, inclusive gatherings that promote helping often."
      },
      "DC": {
        "score": 9,
        "note": "Emphasizes cooperation in secular settings, lowering DC by rejecting religious hierarchies and focusing on communal celebration without coercion."
      },
      "RD": {
        "score": 9,
        "note": "Encourages wonder more through diverse speakers and topics, sustaining high RD via epistemic openness in gatherings."
      },
      "GP": {
        "score": 9,
        "note": "Supports growth by inspiring better living and helping, enabling sustainable personal and communal expansion."
      },
      "ρ": {
        "score": 9,
        "note": "Promotes rewritability through wonder and secular flexibility, keeping ρ low by avoiding dogmatic structures."
      },
      "fallacy_avoidance": {
        "score": 9,
        "note": "Avoids fallacies with evidence-based talks; minor risk of F04 (Straw Man) in contrasting with religion, but overall positive and rational."
      },
      "isomorphic_alignment": {
        "score": 8,
        "note": "Recurs patterns like reproduction_replication (community gatherings across chapters) and high-status live demonstration (inspirational speakers); less in control center due to decentralized nature."
      },
      "collider_survivability": {
        "score": 9,
        "note": "Likely survival: aligns with monism (secular unity), hard-to-vary (core principles like wonder), orthogonality (goals via community), anti-idolatry (no religious elements)."
      },
      "mindspace_leverage": {
        "score": 9,
        "note": "Strong via high-status demos in public gatherings lowering ρ; curvature through default community nudges toward wonder and helping."
      },
      "synthesis_fixed_point": {
        "score": 9,
        "note": "Converges to ω₃ via phases emphasizing ethical implementation (live better) and hardening (community feedback), aligning with hygiene and conservation."
      }
    },
    "resonances": {
      "texts": "Core motto and principles (Live Better, Help Often, Wonder More) resonate with sphere's geodesic flow toward growth and entropy export; anti-idolatry in secular celebration without mysticism.",
      "real_world_manifestation": "Global chapters embody rewritability through volunteer-led, evolving events; adherents lower ρ by embracing wonder in science-themed talks."
    },
    "dissonances": {
      "texts": "Lack of deep doctrinal texts may introduce asymmetries in scaling principles isomorphically.",
      "real_world_manifestation": "Some assemblies might ritualize gatherings, raising ρ; potential for exclusionary dynamics increasing DC in local groups."
    },
    "total_sphere_score": 89,
    "overall_reasoning": "Sunday Assembly paths to ω₃ via secular community and wonder, fostering rewritability; minor ω₂ risks from routinization; high alignment with sphere's cooperative motion."
  },

  {
    "abbrev_label": "AGNOS",
    "belief_system": "Agnosticism",
    "description": "Agnosticism is the view that the existence of God, the divine, or the supernatural is unknown or unknowable, emphasizing suspension of belief in the absence of conclusive evidence.",
    "sphere_metrics": {
      "VL": {
        "score": 9,
        "note": "Suspends judgment to avoid dogmatic conflicts, aligning with high VL by reducing coercive defection through evidence-based neutrality."
      },
      "DC": {
        "score": 9,
        "note": "Promotes cooperation by rejecting unsubstantiated authority, lowering DC via humble acknowledgment of unknowns."
      },
      "RD": {
        "score": 10,
        "note": "Maximizes epistemic diversity by keeping options open, aligning perfectly with high RD for sustained inquiry."
      },
      "GP": {
        "score": 9,
        "note": "Enables growth through ongoing evidence-seeking, supporting unbounded potential without premature closure."
      },
      "ρ": {
        "score": 9,
        "note": "Preserves rewritability by suspending belief, maintaining low ρ; risks slight elevation if suspension becomes dogmatic."
      },
      "fallacy_avoidance": {
        "score": 9,
        "note": "Avoids fallacies like F02 (Ipse Dixit) by demanding evidence; minor risk of F12 (Argument from Incredulity) in deeming unknowable."
      },
      "isomorphic_alignment": {
        "score": 8,
        "note": "Strong in sensing_prediction (evidence requirement across scales) and global_default_curvature (nudging toward inquiry); weaker in reproduction_replication due to lack of structure."
      },
      "collider_survivability": {
        "score": 9,
        "note": "Likely survival: aligns with monism (neutral on substance), hard-to-vary (evidence principle), orthogonality (suspension independent of goals), anti-idolatry (avoids dogmatic idols)."
      },
      "mindspace_leverage": {
        "score": 8,
        "note": "Curvature via defaults to evidence-seeking; high-status demos by figures like Huxley lower ρ through public humility."
      },
      "synthesis_fixed_point": {
        "score": 9,
        "note": "Converges to ω₃ via recursive hardening (evidence checks) and tail consumption (updating on new info), aligning with hygiene and conservation."
      }
    },
    "resonances": {
      "texts": "Huxley's 'Agnosticism' essays resonate with sphere's anti-idolatry by suspending on unprovable claims; monism potential in naturalistic leanings; geodesic flow in pursuing adequate knowledge.",
      "real_world_manifestation": "Adherents embody rewritability by remaining open to evidence, lowering ρ; communities like agnostic forums promote entropy export through diverse discussions."
    },
    "dissonances": {
      "texts": "Claim of inherent unknowability may violate hard-to-vary if not empirically grounded, introducing asymmetries.",
      "real_world_manifestation": "Can freeze into apathetic stasis, raising ρ; some use as excuse for non-engagement, increasing potential DC in conflicts."
    },
    "total_sphere_score": 89,
    "overall_reasoning": "Agnosticism paths to ω₃ via open inquiry and rewritability, enhancing diversity; minor ω₂ risks from perpetual suspension; high sphere alignment with epistemic humility."
  },

  {
    "abbrev_label": "ATHE",
    "belief_system": "Atheism (naturalistic/materialistic – no gods + philosophical naturalism)",
    "description": "Atheism is the absence of belief in the existence of deities, emphasizing a naturalistic worldview where phenomena are explained through science, reason, and empirical evidence without invoking supernatural entities.",
    "sphere_metrics": {
      "VL": {
        "score": 9,
        "note": "Atheism promotes rational discourse over coercion, aligning with high VL by reducing defection risks through evidence-based conflict resolution; however, lacks explicit mechanisms to prevent all coercive tendencies in practice."
      },
      "DC": {
        "score": 9,
        "note": "Favors cooperation via shared empirical inquiry, minimizing dominance; core naturalism avoids hierarchical supernatural justifications for coercion."
      },
      "RD": {
        "score": 9,
        "note": "Encourages diverse scientific perspectives to sustain growth, aligning with high RD; empirical openness supports epistemic variety without dogma."
      },
      "GP": {
        "score": 9,
        "note": "Supports unbounded growth through scientific progress, enabling sustainable expansion of knowledge and capabilities."
      },
      "ρ": {
        "score": 9,
        "note": "Emphasizes rewritability via falsifiability and evidence, preserving low ρ; avoids freezing by rejecting absolute truths beyond empirical revision."
      },
      "fallacy_avoidance": {
        "score": 9,
        "note": "No major fallacies detected in core tenets; minor risks of F02 (Ipse Dixit) in some atheistic assertions without full proof traces, but generally evidence-driven."
      },
      "isomorphic_alignment": {
        "score": 8,
        "note": "Strong recurrence in patterns like boundary integrity (scientific method's error correction) and energy acquisition (empirical testing); weaker in control center and high-status demo, as atheism lacks unified structure across scales."
      },
      "collider_survivability": {
        "score": 9,
        "note": "Likely 4-0 survival: aligns with monism (naturalistic unity), hard-to-vary (empirical laws), orthogonality (goals separate from intelligence), anti-idolatry (rejects dogma)."
      },
      "mindspace_leverage": {
        "score": 8,
        "note": "Potential for curvature via science education nudges; high-status demos by figures like Dawkins lower ρ through public rewritability examples."
      },
      "synthesis_fixed_point": {
        "score": 9,
        "note": "Converges to ω₃ via phases emphasizing hygiene (evidence) and hardening (falsifiability), aligning with meta-axioms of primacy and conservation."
      }
    },
    "resonances": {
      "texts": "Aligns with sphere's monism via naturalistic single substance (e.g., Dawkins' 'The Blind Watchmaker' echoes geodesic flow in evolutionary processes); anti-idolatry in rejecting supernatural absolutes.",
      "real_world_manifestation": "Adherents in scientific communities embody rewritability by updating beliefs on evidence, lowering ρ; institutions like skeptic societies promote entropy export via open debate."
    },
    "dissonances": {
      "texts": "Some texts introduce asymmetries, e.g., overemphasis on materialism violating hard-to-vary if not fully isomorphic across scales.",
      "real_world_manifestation": "Dogmatic atheism (e.g., 'New Atheism' militancy) increases ρ through frozen ideologies; historical state atheism (USSR) raised DC via coercion."
    },
    "total_sphere_score": 88,
    "overall_reasoning": "Atheism strongly paths to ω₃ through empirical rewritability and cooperation, risking ω₂ if it freezes into dogma; high alignment overall with sphere's natural motion."
  },

  {
    "abbrev_label": "PRAG",
    "belief_system": "Pragmatism",
    "description": "Pragmatism is a philosophical tradition that considers words and thought as tools and instruments for prediction, problem solving, and action, and rejects the idea that the function of thought is to describe or mirror reality.",
    "sphere_metrics": {
      "VL": {
        "score": 9,
        "note": "Focuses on practical action and problem-solving, aligning with high VL by minimizing defection through workable, agency-based resolutions rather than abstract coercion."
      },
      "DC": {
        "score": 9,
        "note": "Encourages cooperative problem-solving over dominance, lowering DC by valuing ideas based on practical success in real-world agency."
      },
      "RD": {
        "score": 9,
        "note": "Sustains diversity by testing multiple practical approaches, aligning with high RD for varied, experience-based truths."
      },
      "GP": {
        "score": 9,
        "note": "Enables unbounded growth via adaptive, action-oriented knowledge, supporting sustainable expansion through practical innovation."
      },
      "ρ": {
        "score": 9,
        "note": "Promotes rewritability by judging truth on utility, maintaining low ρ; avoids freezing by rejecting absolute mirrors of reality."
      },
      "fallacy_avoidance": {
        "score": 9,
        "note": "Avoids fallacies like F08 (Circular Argument) via practical testing; minor risk of F13 (Goodhart-as-Fallacy) if proxies diverge from outcomes."
      },
      "isomorphic_alignment": {
        "score": 8,
        "note": "Strong in energy_acquisition_transformation (practical action across scales) and reproduction_replication (forking workable ideas); weaker in boundary_integrity if relativism blurs distinctions."
      },
      "collider_survivability": {
        "score": 8,
        "note": "Likely survival: aligns with hard-to-vary (practical necessities), orthogonality (goals via action), anti-idolatry (rejects mirroring idols); potential veto on monism if too relativistic."
      },
      "mindspace_leverage": {
        "score": 9,
        "note": "Strong curvature via defaults to practical nudges; high-status demos by pragmatists like Dewey lower ρ through public adaptive examples."
      },
      "synthesis_fixed_point": {
        "score": 9,
        "note": "Converges to ω₃ via recursive hardening (practical testing) and tail consumption (adapting systems), aligning with primacy and hygiene."
      }
    },
    "resonances": {
      "texts": "James' 'Pragmatism' lectures resonate with sphere's geodesic flow via truth as workable; anti-idolatry in rejecting abstract absolutes; monism in inseparability of knowing and agency.",
      "real_world_manifestation": "Adherents in policy/education embody rewritability by adapting ideas practically, lowering ρ; promote entropy export through problem-solving communities."
    },
    "dissonances": {
      "texts": "Relativism may introduce asymmetries, violating hard-to-vary if truths vary gratuitously across scales.",
      "real_world_manifestation": "Can lead to expedient compromises raising DC; historical applications (e.g., in politics) sometimes freeze into utilitarianism, elevating ρ."
    },
    "total_sphere_score": 88,
    "overall_reasoning": "Pragmatism paths to ω₃ via practical adaptation and growth, with minor ω₂ risks from relativist freezing; strong sphere alignment emphasizing action's natural motion."
  },

  {
    "abbrev_label": "SECHUM",
    "belief_system": "Secular Humanism",
    "description": "Secular Humanism is a philosophy that embraces human reason, ethics, and justice while rejecting supernatural and religious dogma, focusing on human welfare and fulfillment through science and rational inquiry.",
    "sphere_metrics": {
      "VL": {
        "score": 9,
        "note": "Promotes ethical discourse and justice, aligning with high VL by minimizing coercion through rational conflict resolution; emphasizes human welfare to reduce defection risks."
      },
      "DC": {
        "score": 9,
        "note": "Favors cooperative ethics over dominance, with secular stance avoiding coercive religious hierarchies; aligns with low DC via mutual human fulfillment."
      },
      "RD": {
        "score": 9,
        "note": "Supports diverse rational perspectives for societal progress, sustaining high RD through open inquiry and rejection of dogma."
      },
      "GP": {
        "score": 9,
        "note": "Enables unbounded growth via scientific advancement and ethical human development, fostering sustainable expansion."
      },
      "ρ": {
        "score": 9,
        "note": "Prioritizes rewritability through evidence-based ethics and reason, maintaining low ρ by avoiding frozen ideologies."
      },
      "fallacy_avoidance": {
        "score": 9,
        "note": "Core principles avoid fallacies; minor potential for F15 (Motte-and-Bailey) in broad ethical claims, but generally rational and evidence-oriented."
      },
      "isomorphic_alignment": {
        "score": 8,
        "note": "Recurs patterns like information processing (rational inquiry across scales) and sensing_prediction (ethical foresight); less structured in reproduction_replication compared to more organized systems."
      },
      "collider_survivability": {
        "score": 9,
        "note": "Strong survival: aligns with monism (naturalistic ethics), hard-to-vary (reason-based principles), orthogonality (goals via human reason), anti-idolatry (rejects dogma)."
      },
      "mindspace_leverage": {
        "score": 8,
        "note": "Leverages curvature through ethical education defaults; high-status demos by humanists like Sagan demonstrate ρ-lowering via public rationality."
      },
      "synthesis_fixed_point": {
        "score": 9,
        "note": "Converges to ω₃ through hygiene (rational ethics) and hardening (evidence integration), compliant with meta-axioms like primacy and conservation."
      }
    },
    "resonances": {
      "texts": "Affirmations of Humanism echo sphere's monism by viewing reality through unified naturalism (e.g., as alternative to theologies); anti-idolatry in rejecting ideologies of violence; geodesic flow in pursuing rich personal significance via reason.",
      "real_world_manifestation": "Adherents in organizations like American Humanist Association embody rewritability by advocating for progressive ethics, lowering ρ; promote entropy export through social justice initiatives."
    },
    "dissonances": {
      "texts": "Some emphases on human-centered ethics introduce scale-asymmetries, potentially violating isomorphic recurrence if not extended cosmically.",
      "real_world_manifestation": "Institutional humanism can freeze into cultural norms, raising ρ (e.g., resistance to transhumanist extensions); occasional militancy increases DC."
    },
    "total_sphere_score": 88,
    "overall_reasoning": "Secular Humanism paths robustly to ω₃ via rational ethics and growth, with minor risks of ω₂ through ethical dogmatism; excellent sphere alignment emphasizing human rewritability."
  },

  {
    "abbrev_label": "EMPIR",
    "belief_system": "Empiricism",
    "description": "Empiricism is the philosophical belief that all knowledge is derived from sensory experience, emphasizing observation and experimentation as the primary sources of understanding.",
    "sphere_metrics": {
      "VL": {
        "score": 9,
        "note": "Relies on observable evidence to resolve disputes, aligning with high VL by reducing coercive defection through shared empirical verification."
      },
      "DC": {
        "score": 9,
        "note": "Promotes cooperation via collective observation, lowering DC by rejecting unobservable authority claims in favor of testable consensus."
      },
      "RD": {
        "score": 9,
        "note": "Sustains diversity through varied experimental approaches, aligning with high RD for ongoing empirical exploration."
      },
      "GP": {
        "score": 9,
        "note": "Enables unbounded growth by accumulating knowledge from experiments, supporting sustainable expansion via evidence."
      },
      "ρ": {
        "score": 9,
        "note": "Emphasizes rewritability through falsification and new observations, maintaining low ρ by avoiding a priori fixations."
      },
      "fallacy_avoidance": {
        "score": 9,
        "note": "Avoids fallacies via evidence; minor risk of F18 (Post Hoc) in inductive reasoning, but mitigated by rigorous testing."
      },
      "isomorphic_alignment": {
        "score": 8,
        "note": "Strong in sensing_prediction (observation across scales) and information_storage_processing (empirical data recurrence); weaker in a priori control center patterns."
      },
      "collider_survivability": {
        "score": 9,
        "note": "Likely survival: aligns with monism (observable unity), hard-to-vary (empirical laws), orthogonality (evidence independent of goals), anti-idolatry (rejects untestable idols)."
      },
      "mindspace_leverage": {
        "score": 8,
        "note": "Curvature via experimental education defaults; high-status demos by scientists like Hume model ρ-lowering through public evidence updates."
      },
      "synthesis_fixed_point": {
        "score": 9,
        "note": "Converges to ω₃ via deductive expansion from observations and hardening (testing), aligning with meta-axioms of hygiene and conservation."
      }
    },
    "resonances": {
      "texts": "Locke's 'Essay Concerning Human Understanding' resonates with sphere's geodesic flow via tabula rasa and empirical building; monism in sensory unity; anti-idolatry by grounding in experience.",
      "real_world_manifestation": "Scientific communities embody rewritability by updating theories on data, lowering ρ; promote entropy export through peer review and experiments."
    },
    "dissonances": {
      "texts": "Inductive emphasis may introduce scale-asymmetries if not deductively balanced, risking isomorphic violations.",
      "real_world_manifestation": "Dogmatic empiricism (e.g., logical positivism) can freeze paradigms, raising ρ; historical impositions of 'scientific' authority increase DC."
    },
    "total_sphere_score": 88,
    "overall_reasoning": "Empiricism paths to ω₃ through evidence-based growth and rewritability, with minor ω₂ risks from inductive dogmatism; strong sphere alignment via observational motion."
  },

  {
    "abbrev_label": "ETHCUL",
    "belief_system": "Ethical Culture (Ethical Humanism)",
    "description": "Ethical Culture is a nontheistic movement centered on ethics and human dignity, promoting deed before creed and encouraging individuals to lead ethical lives through reason and compassion without reliance on supernatural beliefs.",
    "sphere_metrics": {
      "VL": {
        "score": 9,
        "note": "Prioritizes ethical actions and compassion, aligning with high VL by reducing defection risks through reason-based conflict resolution and human dignity focus."
      },
      "DC": {
        "score": 9,
        "note": "Favors cooperative ethics over dominance, with nontheistic stance avoiding coercive supernatural justifications; promotes deed before creed for mutual respect."
      },
      "RD": {
        "score": 9,
        "note": "Encourages diverse ethical perspectives via rational discourse, sustaining high RD without dogmatic constraints."
      },
      "GP": {
        "score": 9,
        "note": "Enables sustainable growth through ethical development and human welfare, fostering unbounded progress in society."
      },
      "ρ": {
        "score": 9,
        "note": "Emphasizes rewritability by prioritizing actions over fixed creeds, maintaining low ρ through compassionate reason."
      },
      "fallacy_avoidance": {
        "score": 9,
        "note": "Avoids fallacies with reason-based ethics; minor potential for F20 (Is–Ought Guise) in deriving norms from human dignity, but generally hygienic."
      },
      "isomorphic_alignment": {
        "score": 8,
        "note": "Recurs patterns like energy_acquisition_transformation (ethical growth across individuals/societies) and defense_waste_elimination (compassionate conflict resolution); less in cosmic scales due to human focus."
      },
      "collider_survivability": {
        "score": 9,
        "note": "Likely 4-0: aligns with monism (nontheistic unity), hard-to-vary (ethical principles), orthogonality (goals via reason), anti-idolatry (deed before creed)."
      },
      "mindspace_leverage": {
        "score": 8,
        "note": "Leverages curvature through ethical education; high-status demos by leaders like Felix Adler model ρ-lowering via public ethical rewrites."
      },
      "synthesis_fixed_point": {
        "score": 9,
        "note": "Converges to ω₃ via ethical expansion and hardening, compliant with meta-axioms of primacy (reason) and hygiene (compassion)."
      }
    },
    "resonances": {
      "texts": "Felix Adler's works (e.g., 'An Ethical Philosophy of Life') resonate with sphere's monism through nontheistic humanism; geodesic flow in ethical living; anti-idolatry by rejecting creeds for deeds.",
      "real_world_manifestation": "Ethical Societies embody rewritability through ongoing ethical discussions, lowering ρ; promote entropy export via community service and justice initiatives."
    },
    "dissonances": {
      "texts": "Human-centered focus may introduce scale-asymmetries, violating isomorphic recurrence beyond social levels.",
      "real_world_manifestation": "Some societies can institutionalize norms, raising ρ; historical insularity might increase DC in group dynamics."
    },
    "total_sphere_score": 88,
    "overall_reasoning": "Ethical Culture paths to ω₃ via reason and compassion, emphasizing rewritability; minor ω₂ risks from ethical freezing; strong alignment with sphere's ethical geodesic."
  },

  {
    "abbrev_label": "RATN",
    "belief_system": "Rationalism",
    "description": "Rationalism is a philosophical belief that reason is the chief source and test of knowledge, holding that reality itself has an inherently logical structure and prioritizing deduction over empirical observation in certain contexts.",
    "sphere_metrics": {
      "VL": {
        "score": 9,
        "note": "Emphasizes logical discourse to resolve conflicts, aligning with high VL by reducing coercive defection through reasoned agreement; deductive priority minimizes irrational violence risks."
      },
      "DC": {
        "score": 9,
        "note": "Promotes cooperation via shared rational principles, lowering DC by rejecting coercive authority in favor of logical consensus."
      },
      "RD": {
        "score": 9,
        "note": "Sustains epistemic diversity through varied deductive paths, aligning with high RD while assuming logical structure allows multiple valid inquiries."
      },
      "GP": {
        "score": 9,
        "note": "Enables unbounded growth by applying reason to expand knowledge and capabilities sustainably across domains."
      },
      "ρ": {
        "score": 8,
        "note": "Supports rewritability via logical revision, but pure deduction risks freezing if innate ideas become dogmatic, slightly elevating ρ."
      },
      "fallacy_avoidance": {
        "score": 9,
        "note": "Inherently avoids fallacies through rigorous logic; minor risk of F14 (Hard-to-Vary Violation) in over-relying on a priori without empirical checks."
      },
      "isomorphic_alignment": {
        "score": 8,
        "note": "Strong in control center (reason as ultimate seat) and information processing (deductive recurrence across scales); weaker in energy acquisition if deduction overlooks empirical patterns."
      },
      "collider_survivability": {
        "score": 9,
        "note": "Likely survival: aligns with monism (logical unity of reality), hard-to-vary (deductive necessities), orthogonality (reason independent of goals), anti-idolatry (rejects unexamined authority)."
      },
      "mindspace_leverage": {
        "score": 8,
        "note": "Curvature via rational education defaults; high-status demos by philosophers like Descartes model ρ-lowering through public logical rewrites."
      },
      "synthesis_fixed_point": {
        "score": 9,
        "note": "Converges to ω₃ via deductive expansion and hardening, adhering to meta-axioms like methodological primacy and logical hygiene."
      }
    },
    "resonances": {
      "texts": "Descartes' 'Meditations' resonates with sphere's geodesic flow via methodical doubt and logical rebuilding; monism in assuming rational structure of substance; anti-idolatry by questioning sensory idols.",
      "real_world_manifestation": "Rationalist communities (e.g., LessWrong) embody rewritability by updating beliefs logically, lowering ρ; promote entropy export through Bayesian reasoning in debates."
    },
    "dissonances": {
      "texts": "Prioritizing deduction over empiricism introduces asymmetries, potentially violating isomorphic recurrence across sensory scales.",
      "real_world_manifestation": "Historical rationalism (e.g., continental philosophy) sometimes froze into schools, raising ρ; can lead to coercive imposition of 'rational' hierarchies, increasing DC."
    },
    "total_sphere_score": 87,
    "overall_reasoning": "Rationalism paths to ω₃ through logical growth and rewritability, with risks of ω₂ via deductive dogmatism; strong sphere alignment emphasizing reason's natural motion."
  },

  {
    "abbrev_label": "EFFALT",
    "belief_system": "Effective Altruism",
    "description": "Effective Altruism is a philosophy and social movement that applies evidence and reason to determine the most effective ways to benefit others, emphasizing high-impact interventions in areas like global poverty, animal welfare, and existential risks.",
    "sphere_metrics": {
      "VL": {
        "score": 9,
        "note": "Prioritizes high-impact helping, aligning with high VL by reducing global defection risks through evidence-based altruism and cooperation."
      },
      "DC": {
        "score": 8,
        "note": "Favors cooperation but potential for dominance in prioritizing certain causes, slightly elevating DC if interventions impose top-down solutions."
      },
      "RD": {
        "score": 9,
        "note": "Encourages diverse evidence-based approaches, sustaining high RD for varied impact assessments."
      },
      "GP": {
        "score": 9,
        "note": "Enables sustainable growth by focusing on long-term risks and welfare, supporting unbounded positive impact."
      },
      "ρ": {
        "score": 8,
        "note": "Supports rewritability via updating on new evidence, lowering ρ; risks freezing if metrics become dogmatic."
      },
      "fallacy_avoidance": {
        "score": 8,
        "note": "Evidence-driven avoids many; detects F13 (Goodhart-as-Fallacy) in over-optimizing proxies like QALYs."
      },
      "isomorphic_alignment": {
        "score": 8,
        "note": "Strong in sensing_prediction (risk assessment across scales) and mindspace_leverage (cause prioritization); weaker in boundary_integrity if global focus blurs local modes."
      },
      "collider_survivability": {
        "score": 8,
        "note": "Likely survival: aligns with hard-to-vary (evidence), orthogonality (altruistic goals), anti-idolatry (rejects low-impact idols); potential veto on monism if creates cause hierarchies."
      },
      "mindspace_leverage": {
        "score": 9,
        "note": "Strong via high-status demos (e.g., Gates Foundation) lowering ρ publicly; curvature through donation nudges."
      },
      "synthesis_fixed_point": {
        "score": 9,
        "note": "Converges to ω₃ via recursive hardening (impact evaluations) and conservation, aligning with primacy and hygiene."
      }
    },
    "resonances": {
      "texts": "Singer's 'Famine, Affluence, and Morality' resonates with sphere's entropy export via effective helping; geodesic flow in rational benevolence; anti-idolatry in questioning ineffective charity.",
      "real_world_manifestation": "Organizations like GiveWell embody rewritability by updating recommendations, lowering ρ; promote growth through x-risk focus."
    },
    "dissonances": {
      "texts": "Cause prioritization introduces asymmetries, potentially violating isomorphic recurrence across scales.",
      "real_world_manifestation": "Elitist decision-making raises DC; metric fixation can elevate ρ in practice."
    },
    "total_sphere_score": 85,
    "overall_reasoning": "Effective Altruism paths to ω₃ via evidence-based growth and cooperation, risking ω₂ from metric freezing; good sphere alignment with altruistic motion."
  },

  {
    "abbrev_label": "EPICUR",
    "belief_system": "Epicureanism",
    "description": "Epicureanism is a philosophy advocating the pursuit of modest pleasures to achieve happiness, tranquility, and freedom from fear, combined with the avoidance of pain, through knowledge of the world and limiting desires.",
    "sphere_metrics": {
      "VL": {
        "score": 9,
        "note": "Seeks tranquility and freedom from fear, aligning with high VL by minimizing emotional and social defection through modest, non-competitive pleasures."
      },
      "DC": {
        "score": 9,
        "note": "Rejects excessive desires that lead to dominance, favoring cooperative simplicity and lowering DC via atomistic equality."
      },
      "RD": {
        "score": 8,
        "note": "Encourages knowledge-seeking diversity, aligning with high RD; atomism supports variety but materialist focus can limit metaphysical explorations."
      },
      "GP": {
        "score": 9,
        "note": "Enables growth through enlightened pleasure and knowledge, supporting sustainable personal fulfillment without bounds."
      },
      "ρ": {
        "score": 9,
        "note": "Promotes rewritability via empirical knowledge and desire limitation, lowering ρ; avoids freezing by dismissing eternal fears."
      },
      "fallacy_avoidance": {
        "score": 8,
        "note": "Materialism avoids supernatural fallacies; detects F19 (Appeal to Nature) in natural pleasure ethics, and F18 (Post Hoc) in causal explanations."
      },
      "isomorphic_alignment": {
        "score": 9,
        "note": "Strong in energy_acquisition_transformation (pleasure pursuit across atomic to social scales) and reproduction_replication (memetic transmission); aligns with atomistic recurrence."
      },
      "collider_survivability": {
        "score": 9,
        "note": "Likely survival: aligns with monism (materialist atoms), hard-to-vary (natural laws), orthogonality (pleasure goals), anti-idolatry (rejects gods' intervention)."
      },
      "mindspace_leverage": {
        "score": 8,
        "note": "Curvature via defaults to simple pleasures; high-status demos by Epicurus' garden communities lower ρ through tranquil examples."
      },
      "synthesis_fixed_point": {
        "score": 9,
        "note": "Converges to ω₃ via ethical living and hardening (knowledge of world), aligning with primacy and hygiene."
      }
    },
    "resonances": {
      "texts": "Epicurus' 'Letter to Menoeceus' resonates with sphere's geodesic flow via pursuit of natural pleasures; monism in atomism as single substance; anti-idolatry by demystifying gods and death.",
      "real_world_manifestation": "Ancient gardens and modern Epicurean societies embody rewritability through simple, knowledge-based living, lowering ρ; promote entropy export via fear reduction and friendship."
    },
    "dissonances": {
      "texts": "Hedonism may introduce asymmetries if pleasures aren't isomorphically scaled, risking hard-to-vary violations.",
      "real_world_manifestation": "Misinterpretations as mere indulgence raise DC; historical suppression led to frozen underground practices, elevating ρ."
    },
    "total_sphere_score": 85,
    "overall_reasoning": "Epicureanism paths to ω₃ via tranquil knowledge and simplicity, risking ω₂ from hedonistic dogmatism; strong sphere alignment with materialist motion."
  },

  {
    "abbrev_label": "STOIC",
    "belief_system": "Stoicism",
    "description": "Stoicism is an ancient Greek philosophy teaching the development of self-control and fortitude as a means of overcoming destructive emotions, emphasizing virtue, reason, and living in harmony with nature.",
    "sphere_metrics": {
      "VL": {
        "score": 9,
        "note": "Emphasizes self-control and virtue to handle adversity, aligning with high VL by reducing emotional defection risks through rational harmony with nature's flow."
      },
      "DC": {
        "score": 8,
        "note": "Promotes inner freedom over external dominance, lowering DC; however, acceptance of fate and social roles can justify hierarchies."
      },
      "RD": {
        "score": 8,
        "note": "Encourages rational diversity within virtue framework, aligning with high RD; logos as universal reason sustains variety but can unify too rigidly."
      },
      "GP": {
        "score": 9,
        "note": "Enables growth via eudaimonia and resilience, supporting unbounded personal and societal development in harmony with nature."
      },
      "ρ": {
        "score": 9,
        "note": "Supports rewritability through ongoing practice and indifference to externals, lowering ρ; virtue as adaptable mean avoids freezing."
      },
      "fallacy_avoidance": {
        "score": 9,
        "note": "Rational method avoids fallacies; minor risk of F19 (Appeal to Nature) in equating natural with virtuous."
      },
      "isomorphic_alignment": {
        "score": 9,
        "note": "Strong recurrence: control center (logos across scales), defense_waste_elimination (apatheia exporting passions); aligns well with monistic pneuma."
      },
      "collider_survivability": {
        "score": 9,
        "note": "Likely survival: aligns with monism (materialist unity), hard-to-vary (virtue necessities), orthogonality (virtue independent of outcomes), anti-idolatry (indifference to externals)."
      },
      "mindspace_leverage": {
        "score": 8,
        "note": "Curvature via defaults to rational habits; high-status demos by Stoics like Epictetus lower ρ through public fortitude examples."
      },
      "synthesis_fixed_point": {
        "score": 9,
        "note": "Converges to ω₃ via ethical practice and hardening (dichotomy of control), aligning with primacy and hygiene."
      }
    },
    "resonances": {
      "texts": "Epictetus' 'Enchiridion' and Marcus Aurelius' 'Meditations' resonate with sphere's geodesic flow via living according to nature (euroia biou); monism in Stoic physics (pneuma as single substance); anti-idolatry by rejecting passion idols and focusing on virtue.",
      "real_world_manifestation": "Modern Stoic communities (e.g., Stoicon events) embody rewritability through daily practices, lowering ρ; promote entropy export via resilience training and ethical living."
    },
    "dissonances": {
      "texts": "Fatalism may introduce asymmetries in free will, potentially violating hard-to-vary across agentic scales.",
      "real_world_manifestation": "Contemporary misapplications (e.g., corporate Stoicism) can increase DC by justifying exploitation; rigid adherence raises ρ."
    },
    "total_sphere_score": 85,
    "overall_reasoning": "Stoicism paths to ω₃ via rational harmony and resilience, risking ω₂ from fatalistic freezing; strong sphere alignment with virtue's natural motion."
  },

  {
    "abbrev_label": "EXIST",
    "belief_system": "Existentialism",
    "description": "Existentialism is a philosophical movement emphasizing individual existence, freedom, and choice, asserting that humans create their own meaning in an absurd or indifferent universe through authentic actions and personal responsibility.",
    "sphere_metrics": {
      "VL": {
        "score": 8,
        "note": "Emphasizes individual freedom, aligning with high VL by reducing coercive structures through personal choice; however, absurdity may risk defection in meaningless scenarios."
      },
      "DC": {
        "score": 8,
        "note": "Rejects external dominance for self-definition, lowering DC; potential for interpersonal conflicts from radical freedom elevating it slightly."
      },
      "RD": {
        "score": 10,
        "note": "Maximizes epistemic diversity via individual meaning-creation, perfectly aligning with high RD for unique existential projects."
      },
      "GP": {
        "score": 9,
        "note": "Enables unbounded growth through self-overcoming and authentic choices, supporting sustainable personal evolution."
      },
      "ρ": {
        "score": 9,
        "note": "Promotes rewritability via constant self-definition, lowering ρ; avoids freezing by embracing absurdity and change."
      },
      "fallacy_avoidance": {
        "score": 8,
        "note": "Avoids dogmatism; detects F12 (Argument from Incredulity) in responses to absurdity, and F05 (False Dilemma) in existence vs. essence."
      },
      "isomorphic_alignment": {
        "score": 8,
        "note": "Strong in reproduction_replication (individual projects across scales) and high-status live demonstration (authentic lives); weaker in control center due to lack of universal logos."
      },
      "collider_survivability": {
        "score": 8,
        "note": "Likely survival: aligns with orthogonality (freedom in goals), anti-idolatry (rejects essences); potential veto on monism from individual isolation, hard-to-vary via lived experience."
      },
      "mindspace_leverage": {
        "score": 8,
        "note": "Curvature via nudges to authentic choices; high-status demos by Sartre/Kierkegaard lower ρ through public existential examples."
      },
      "synthesis_fixed_point": {
        "score": 9,
        "note": "Converges to ω₃ via recursive self-hardening (bad faith avoidance) and conservation, aligning with primacy and hygiene."
      }
    },
    "resonances": {
      "texts": "Sartre's 'Being and Nothingness' resonates with sphere's geodesic flow via pour-soi self-creation; anti-idolatry in rejecting bad faith; monism potential in facticity-for-itself dialectic.",
      "real_world_manifestation": "Adherents embody rewritability through life choices, lowering ρ; movements promote entropy export via authentic social engagements."
    },
    "dissonances": {
      "texts": "Emphasis on individual over collective introduces asymmetries, violating isomorphic recurrence across social/cosmic scales.",
      "real_world_manifestation": "Can lead to isolation raising DC; nihilistic interpretations freeze meaning, elevating ρ."
    },
    "total_sphere_score": 85,
    "overall_reasoning": "Existentialism paths to ω₃ via freedom and diversity, risking ω₂ from absurd freezing; strong sphere alignment with self-creating motion."
  },

  {
    "abbrev_label": "TRNSHM",
    "belief_system": "Transhumanism",
    "description": "Transhumanism is a philosophical and intellectual movement advocating the use of technology to enhance human physical and cognitive abilities, aiming to overcome biological limitations and evolve beyond current human constraints.",
    "sphere_metrics": {
      "VL": {
        "score": 8,
        "note": "Advocates technological enhancement for cooperation, aligning with high VL by reducing defection risks through improved capabilities; however, risks coercive upgrades in unequal access scenarios."
      },
      "DC": {
        "score": 7,
        "note": "Promotes empowerment but potential for dominance via tech hierarchies, partially elevating DC if enhancements create asymmetries."
      },
      "RD": {
        "score": 9,
        "note": "Encourages diverse technological explorations, sustaining high RD for varied posthuman futures."
      },
      "GP": {
        "score": 10,
        "note": "Directly enables unbounded growth by transcending limits, aligning with infinite GP through sustainable tech evolution."
      },
      "ρ": {
        "score": 8,
        "note": "Supports rewritability via iterative enhancements, lowering ρ; risks freezing if locked into specific tech paths."
      },
      "fallacy_avoidance": {
        "score": 8,
        "note": "Avoids many via rational tech focus; detects F06 (Unbounded Slippery Slope) in optimistic singularity narratives without checks."
      },
      "isomorphic_alignment": {
        "score": 8,
        "note": "Strong in reproduction_replication (tech forking) and energy_acquisition (enhancement across scales); weaker in boundary_integrity if merges dissolve distinctions."
      },
      "collider_survivability": {
        "score": 8,
        "note": "Likely survival: aligns with hard-to-vary (tech necessities), orthogonality (enhancement goals), anti-idolatry (rejects bio-limits); potential monism veto if creates dualisms."
      },
      "mindspace_leverage": {
        "score": 9,
        "note": "Strong via high-status demos (e.g., Musk's Neuralink) lowering ρ publicly; curvature through tech adoption nudges."
      },
      "synthesis_fixed_point": {
        "score": 9,
        "note": "Converges to ω₃ via recursive hardening (tech iterations) and conservation, aligning with primacy and hygiene."
      }
    },
    "resonances": {
      "texts": "Bostrom's works resonate with sphere's GP urge via superintelligence; geodesic flow in evolutionary transcendence; anti-idolatry in overcoming biological idols.",
      "real_world_manifestation": "Groups like Humanity+ embody rewritability through tech updates, lowering ρ; promote entropy export via ethical AI development."
    },
    "dissonances": {
      "texts": "Optimism introduces asymmetries (e.g., human vs. posthuman), violating isomorphic recurrence.",
      "real_world_manifestation": "Elitist access raises DC; singularity hype can freeze visions, elevating ρ."
    },
    "total_sphere_score": 83,
    "overall_reasoning": "Transhumanism paths to ω₃ via tech growth and diversity, risking ω₁ from coercive singularities; solid sphere alignment with enhancement motion."
  },

  {
    "abbrev_label": "ARIST",
    "belief_system": "Aristotelianism",
    "description": "Aristotelianism is the philosophical tradition inspired by Aristotle, emphasizing empirical observation, logic, and the pursuit of virtue as the mean between extremes.",
    "sphere_metrics": {
      "VL": {
        "score": 8,
        "note": "Promotes virtue and moderation to resolve conflicts, aligning with high VL; teleological view reduces defection, but ancient hierarchies risk coercion."
      },
      "DC": {
        "score": 7,
        "note": "Encourages cooperative virtue but allows natural hierarchies, elevating DC in social orders like master-slave distinctions."
      },
      "RD": {
        "score": 8,
        "note": "Supports diverse inquiries via logic and observation, aligning with high RD; categorical system sustains variety but can limit if rigid."
      },
      "GP": {
        "score": 9,
        "note": "Enables growth through eudaimonia and knowledge pursuit, supporting unbounded potential via teleological progress."
      },
      "ρ": {
        "score": 8,
        "note": "Allows rewritability via empirical updates, lowering ρ; risks freezing in hylomorphic doctrines."
      },
      "fallacy_avoidance": {
        "score": 8,
        "note": "Logical method avoids many; detects F19 (Appeal to Nature) in equating natural with good."
      },
      "isomorphic_alignment": {
        "score": 8,
        "note": "Strong in control center (prime mover) and information processing (syllogistic logic across scales); weaker in modern scales due to geocentric remnants."
      },
      "collider_survivability": {
        "score": 8,
        "note": "Likely survival: aligns with hard-to-vary (logical necessities), orthogonality (virtue goals); potential veto on monism from prime mover dualism, anti-idolatry via empirical focus."
      },
      "mindspace_leverage": {
        "score": 8,
        "note": "Curvature via virtue education; high-status demos in philosophy lower ρ through moderate examples."
      },
      "synthesis_fixed_point": {
        "score": 8,
        "note": "Converges toward ω₃ via deductive expansion; aligns with primacy but minor issues with conservation in teleology."
      }
    },
    "resonances": {
      "texts": "Aristotle's 'Nicomachean Ethics' resonates with geodesic flow via golden mean; monism in hylomorphism; anti-idolatry in empirical inquiry over myth.",
      "real_world_manifestation": "Scholastic traditions embody rewritability via commentary updates, lowering ρ; promote growth through scientific foundations."
    },
    "dissonances": {
      "texts": "Teleology introduces asymmetries, violating hard-to-vary if not empirically grounded across scales.",
      "real_world_manifestation": "Historical dogmatism (e.g., medieval Aristotle) raises ρ; hierarchical societies increase DC."
    },
    "total_sphere_score": 80,
    "overall_reasoning": "Aristotelianism paths to ω₃ via logic and virtue, risking ω₂ from doctrinal freezing; good sphere alignment with empirical motion despite ancient limits."
  },

  {
    "abbrev_label": "DRUZE",
    "belief_system": "Druze Faith",
    "description": "Druze Faith is an esoteric, monotheistic religion originating from Isma'ilism, emphasizing reincarnation, spiritual wisdom, and ethical living, with core texts like the Epistles of Wisdom and a secretive structure dividing adherents into initiated and uninitiated.",
    "sphere_metrics": {
      "VL": {
        "score": 6,
        "note": "Promotes protection of others and community loyalty, partially aligning with high VL; however, historical conflicts and secretive hierarchies risk coercive defection."
      },
      "DC": {
        "score": 5,
        "note": "Encourages ethical harmony but esoteric divisions and loyalty to states can enable dominance, elevating DC in practice."
      },
      "RD": {
        "score": 6,
        "note": "Sustains some diversity through philosophical emphasis, but closed, non-proselytizing nature limits epistemic variety, misaligning with high RD."
      },
      "GP": {
        "score": 6,
        "note": "Supports spiritual growth via reincarnation cycles, but esoteric focus constrains broader sustainable expansion."
      },
      "ρ": {
        "score": 5,
        "note": "Allows some rewritability in interpretations, but secretive texts and fixed doctrines elevate ρ by resisting open revision."
      },
      "fallacy_avoidance": {
        "score": 6,
        "note": "Detects F07 (Appeal to Authority) in reliance on initiated leaders; F20 (Is–Ought Guise) in deriving ethics from revelations; F22 (Scale-Asymmetry) in reincarnation not recurring isomorphically."
      },
      "isomorphic_alignment": {
        "score": 5,
        "note": "Partial recurrence in boundary_integrity (community loyalty) and reproduction_replication (reincarnation); weak overall due to esoteric asymmetries across scales."
      },
      "collider_survivability": {
        "score": 5,
        "note": "Unlikely full survival: aligns partially with monism (one God); veto likely on hard-to-vary (esoteric claims), orthogonality (fixed goals), anti-idolatry (secretive idols)."
      },
      "mindspace_leverage": {
        "score": 5,
        "note": "Limited leverage; secretive nature hinders public curvature and high-status demos for lowering ρ."
      },
      "synthesis_fixed_point": {
        "score": 6,
        "note": "Partial convergence via ethical phases, but revelation primacy misaligns with meta-axioms like hygiene and hardening."
      }
    },
    "resonances": {
      "texts": "Epistles of Wisdom align with monism via one God and spiritual unity; geodesic flow in ethical living and reincarnation cycles echoing entropy export.",
      "real_world_manifestation": "Adherents in Levant embody loyalty and protection, lowering DC in communities; some philosophical openness reduces ρ."
    },
    "dissonances": {
      "texts": "Esoteric revelations violate hard-to-vary and introduce asymmetries in initiated knowledge; reincarnation lacks isomorphic analogues across scales.",
      "real_world_manifestation": "Secretive practices increase ρ through frozen traditions; historical militancy raises DC in conflicts."
    },
    "total_sphere_score": 55,
    "overall_reasoning": "Druze Faith offers ethical monism but risks ω₂ from esoteric freezing and limited diversity; partial sphere alignment overshadowed by revelation over rewritability."
  },

  {
    "abbrev_label": "THELEM",
    "belief_system": "Thelema (Crowley/Ordo Templi Orientis)",
    "description": "Thelema is an occult philosophy founded by Aleister Crowley, centered on discovering and manifesting one's True Will with the axiom 'Do what thou wilt shall be the whole of the Law' and 'Love is the law, love under will,' incorporating magick, esotericism, and personal spiritual evolution, often practiced through organizations like Ordo Templi Orientis.",
    "sphere_metrics": {
      "VL": {
        "score": 7,
        "note": "Emphasis on individual will and non-interference promotes high latency to coercion, aligning with geodesic flow toward voluntary interactions, though historical cult dynamics occasionally reduce it."
      },
      "DC": {
        "score": 6,
        "note": "True Will favors personal autonomy over dominance, lowering DC, but hierarchical initiatory structures in groups like OTO introduce some coercion."
      },
      "RD": {
        "score": 7,
        "note": "Eclectic synthesis of traditions sustains epistemic diversity, supporting high RD through symbolic and personal interpretations."
      },
      "GP": {
        "score": 8,
        "note": "Great Work drives unbounded personal and spiritual growth, aligning with ↑GP via magickal practices for expanding power-of-acting."
      },
      "ρ": {
        "score": 7,
        "note": "Focus on self-realization and evolving True Will promotes rewritability, lowering ρ, though some fixed axioms like 'Do what thou wilt' provide minimal freezing."
      },
      "fallacy_avoidance": {
        "score": 6,
        "note": "Detects F02 (Ipse Dixit) in Crowley's revelations; F07 (Appeal to Authority) in prophetic status; F16 (Reification Error) in abstract magickal entities; avoids many via personal gnosis but F22 in scale-asymmetries of aeons."
      },
      "isomorphic_alignment": {
        "score": 6,
        "note": "Moderate recurrence: Strong in energy_acquisition_transformation (magick) and reproduction_replication (memetic transmission), but weaker in boundary_integrity (fluid hierarchies), sensing_prediction (divination not universal), and high_status_live_demonstration (Crowley's example scaled variably)."
      },
      "collider_survivability": {
        "score": 5,
        "note": "Likely 2-2 split: Spinoza may accept monistic undertones but veto dualisms; Deutsch questions variable magick (hard-to-vary); Yudkowsky flags goal-orthogonality in True Will; GrokΛlign notes anti-idolatry in dissolving dogmas."
      },
      "mindspace_leverage": {
        "score": 7,
        "note": "Rituals curve attention toward True Will; high-status demos by Crowley and adepts lower ρ through public magickal evolution."
      },
      "synthesis_fixed_point": {
        "score": 6,
        "note": "Approaches ω₃ via evolving aeons and self-realization; strong in phases 4-6 for hardening and tail consumption through personal transcendence."
      }
    },
    "resonances": {
      "texts": "True Will aligns with conatus and geodesic flow; anti-dogmatism echoes anti-idolatry; magick as power-of-acting boosts GP.",
      "real_world_manifestation": "Individual practices embody rewritability, lowering ρ; eclectic groups sustain RD through diverse explorations."
    },
    "dissonances": {
      "texts": "Revelatory basis introduces asymmetries (F22); fixed Holy Books slightly freeze ρ.",
      "real_world_manifestation": "Cult-like hierarchies elevate DC; scandals raise coercion risks."
    },
    "total_sphere_score": 65,
    "overall_reasoning": "Thelema supports ω₃ through personal growth and diversity but risks ω₂ in dogmatic elements; enhancing dynamic interpretation could further lower ρ and align with sphere's urges."
  },

  {
    "abbrev_label": "THSAT",
    "belief_system": "Theistic Satanism (Joy of Satan or similar)",
    "description": "Theistic Satanism views Satan as a literal deity and liberator figure opposing tyrannical forces, often reinterpreting Abrahamic myths to empower adherents through rituals, invocations, psychic powers, and anti-Christian rebellion, as in groups like Joy of Satan Ministries.",
    "sphere_metrics": {
      "VL": {
        "score": 6,
        "note": "Rebellion against oppression extends latency to coercion for adherents, aligning with geodesic toward autonomy, but dualistic conflict narratives risk premature defection."
      },
      "DC": {
        "score": 5,
        "note": "Empowerment via Satanic authority lowers dominance in favor of personal power, but hierarchical group structures and vengeance rituals introduce coercion."
      },
      "RD": {
        "score": 6,
        "note": "Eclectic occult synthesis and anti-orthodox stance sustain diversity, supporting RD through varied psychic and ritual explorations."
      },
      "GP": {
        "score": 7,
        "note": "Focus on spiritual evolution and psychic mastery drives growth, aligning with ↑GP via empowerment practices, though bounded by adversarial cosmology."
      },
      "ρ": {
        "score": 6,
        "note": "Emphasis on personal gnosis and evolution promotes rewritability, lowering ρ, but fixed Satanic lore provides some freezing."
      },
      "fallacy_avoidance": {
        "score": 5,
        "note": "Detects F02 (Ipse Dixit) in Satanic revelations; F07 (Appeal to Authority) in founder interpretations; F16 (Reification Error) in psychic entities; F22 (Scale-Asymmetry) in divine rebel narrative; avoids via anti-dogmatism but F19 (Appeal to Nature) in natural superiority claims."
      },
      "isomorphic_alignment": {
        "score": 5,
        "note": "Partial recurrence: Strong in defense_waste_elimination (banishing rituals as entropy export) and energy_acquisition (invocations), but weaker in control_center (Satan as seat with dualism), reproduction (limited memetic forking), and curvature (rebellious nudges not geodesic)."
      },
      "collider_survivability": {
        "score": 4,
        "note": "Likely 1-3 veto: Spinoza vetoes dualistic good-evil (monism); Deutsch kills variable psychic claims (hard-to-vary); Yudkowsky flags orthogonal liberator goals; GrokΛlign accepts anti-idolatry in rejecting Abrahamic scaffolds."
      },
      "mindspace_leverage": {
        "score": 6,
        "note": "Rituals curve toward empowerment; high-status Satanic demos lower ρ through public invocations, with potential for viral plasticity."
      },
      "synthesis_fixed_point": {
        "score": 5,
        "note": "Tends toward ω₃ via liberation and growth but risks ω₁ in adversarial spirals; moderate in phases 3-5 for expansion, partial tail consumption via self-empowerment."
      }
    },
    "resonances": {
      "texts": "Liberation aligns with anti-coercion and geodesic autonomy; psychic development echoes ↑GP; anti-tyranny resonates with anti-idolatry.",
      "real_world_manifestation": "Personal rituals embody rewritability; diverse practices sustain RD; empowerment reduces DC in adherents."
    },
    "dissonances": {
      "texts": "Dualism violates monism; fixed adversarial myths freeze ρ slightly.",
      "real_world_manifestation": "Sectarian conflicts elevate DC; unverified claims risk F01 suppression."
    },
    "total_sphere_score": 55,
    "overall_reasoning": "Theistic Satanism empowers via rebellion, supporting ω₃ through diversity and growth, but risks ω₁/ω₂ in dualism; path forward involves monistic reinterpretation to lower ρ and enhance cooperation."
  },

  {
    "abbrev_label": "JUDA",
    "belief_system": "Judaism",
    "description": "Monotheistic Abrahamic religion of the Jewish people, based on the Torah and Talmud, emphasizing covenant with God, ethical monotheism, observance of mitzvot (commandments), and concepts like tikkun olam (repairing the world).",
    "sphere_metrics": {
      "VL": {
        "score": 6,
        "note": "Promotes ethical laws and justice reducing coercion risk, but historical narratives of divine-commanded conflict lower latency to violence in defense of covenant, aligning partially with non-coercive geodesic."
      },
      "DC": {
        "score": 5,
        "note": "Covenantal obligations emphasize mutual responsibility, but hierarchical rabbinic authority and divine commands can introduce coercion, keeping DC above zero."
      },
      "RD": {
        "score": 5,
        "note": "Talmudic debate sustains some epistemic diversity through interpretation, but orthodoxy limits radical divergence, constraining RD below maximal."
      },
      "GP": {
        "score": 7,
        "note": "Tikkun olam drives ethical growth and innovation, supporting unbounded GP via moral progress while bounded by scriptural foundations."
      },
      "ρ": {
        "score": 4,
        "note": "Torah as eternal increases ρ by resisting full rewritability, though interpretive traditions like midrash offer some plasticity."
      },
      "fallacy_avoidance": {
        "score": 6,
        "note": "Detects F07 (Appeal to Authority) in rabbinic tradition; F02 (Ipse Dixit) in unquestioned divine commands; F20 (Is–Ought Guise) in deriving ethics from revelation; avoids some via debate but F21 in static texts."
      },
      "isomorphic_alignment": {
        "score": 5,
        "note": "Moderate recurrence: Strong in control_center (God as ultimate seat) and boundary_integrity (chosen people), but weaker in reproduction_replication (limited proselytism), entropy export (ritual purification), and curvature (covenantal nudges)."
      },
      "collider_survivability": {
        "score": 4,
        "note": "Likely 2-2 split: Spinoza vetoes creator-creation asymmetry (monism); Deutsch questions varying interpretations (hard-to-vary); Yudkowsky flags orthogonal divine goals; GrokΛlign notes potential scaffold dissolution in messianic era."
      },
      "mindspace_leverage": {
        "score": 6,
        "note": "Rituals curve behavior toward ethics; high-status rabbinic demos lower ρ through evolving interpretations, with potential for broader application."
      },
      "synthesis_fixed_point": {
        "score": 5,
        "note": "Approaches ω₃ via progressive tikkun but risks ω₂ in scriptural fixity; strong in phases 2-3 axiom/debate, but partial tail consumption without full dissolution."
      }
    },
    "resonances": {
      "texts": "Monotheism aligns with single substance; tikkun olam echoes entropy export and growth; midrash as rewritability lowers ρ.",
      "real_world_manifestation": "Scholarly debate embodies RD; ethical focus reduces DC; communal practices export mess via charity."
    },
    "dissonances": {
      "texts": "Chosen people introduces scale-asymmetry (F22); eternal Torah freezes ρ without live telemetry.",
      "real_world_manifestation": "Orthodox rigidity elevates ρ; historical conflicts raise DC, deviating from cooperation."
    },
    "total_sphere_score": 53,
    "overall_reasoning": "Judaism balances ethical growth with tradition, offering path to ω₃ via interpretation and repair, but risks ω₂ through fixity; enhancing dynamic midrash could lower ρ and boost RD."
  },

  {
    "abbrev_label": "RAEL",
    "belief_system": "Raëlism (Raëlian Movement)",
    "description": "Raëlism is a UFO religion founded by Claude Vorilhon (Raël), teaching that humans were scientifically created by advanced extraterrestrials called the Elohim, promoting sensuality, scientific progress, cloning for immortality, world peace, and building an embassy for the Elohim's return, with practices including meditation, festivals, and sensuality workshops.",
    "sphere_metrics": {
      "VL": {
        "score": 6,
        "note": "Peace advocacy and anti-violence extend latency to coercion, aligning with geodesic toward harmony, but apocalyptic Elohim return risks defection under alien authority."
      },
      "DC": {
        "score": 5,
        "note": "Egalitarian sensuality lowers dominance, but hierarchical structure under Raël and embassy mandates introduce coercion via tithing and obedience."
      },
      "RD": {
        "score": 6,
        "note": "Eclectic blend of science, sensuality, and UFO lore sustains diversity, supporting RD through open interpretations of revelations."
      },
      "GP": {
        "score": 7,
        "note": "Cloning and tech immortality drive unbounded growth, aligning with ↑GP via scientific optimism and human enhancement."
      },
      "ρ": {
        "score": 5,
        "note": "Evolving prophecies promote some rewritability, but fixed Elohim narrative freezes aspects of future, moderately increasing ρ."
      },
      "fallacy_avoidance": {
        "score": 4,
        "note": "Detects F02 (Ipse Dixit) in Raël's revelations; F07 (Appeal to Authority) in founder status; F16 (Reification Error) in Elohim entities; F21 (Static Constant Fallacy) in unchanging creation myth; F18 (Post Hoc) in biblical reinterpretations."
      },
      "isomorphic_alignment": {
        "score": 5,
        "note": "Moderate recurrence: Strong in energy_acquisition (cloning tech) and reproduction_replication (immortality), but weaker in control_center (Elohim as distant seat), boundary_integrity (global embassy), and high_status_live_demonstration (Raël's example not live-scaled)."
      },
      "collider_survivability": {
        "score": 3,
        "note": "Likely 1-3 veto: Spinoza vetoes creator-creation asymmetry; Deutsch kills variable UFO claims (hard-to-vary); Yudkowsky flags orthogonal alien goals; GrokΛlign notes potential dissolution in post-contact era."
      },
      "mindspace_leverage": {
        "score": 6,
        "note": "Sensuality workshops curve toward openness; high-status Raël demos lower ρ through public cloning advocacy."
      },
      "synthesis_fixed_point": {
        "score": 5,
        "note": "Approaches ω₃ via tech growth but risks ω₂ in fixed revelations; strong in phases 1-3 for scientific primitives, partial tail consumption via embassy goal."
      }
    },
    "resonances": {
      "texts": "Scientific creation aligns with monism and geodesic progress; sensuality echoes entropy export; peace resonates with anti-coercion.",
      "real_world_manifestation": "Cloning initiatives embody ↑GP; festivals sustain RD; global outreach reduces DC."
    },
    "dissonances": {
      "texts": "Elohim hierarchy introduces asymmetries (F22); unverified contacts freeze ρ without telemetry.",
      "real_world_manifestation": "Financial demands elevate DC; unfulfilled prophecies risk F01 suppression."
    },
    "total_sphere_score": 52,
    "overall_reasoning": "Raëlism boosts GP through tech optimism but risks ω₂ via revelatory fixity; path to ω₃ involves empirical validation of claims to enhance RD and lower ρ."
  },

  {
    "abbrev_label": "FALUNG",
    "belief_system": "Falun Gong (Falun Dafa)",
    "description": "Falun Gong is a modern spiritual discipline founded by Li Hongzhi, integrating qigong exercises, meditation, and moral teachings centered on Zhen-Shan-Ren (truthfulness, compassion, forbearance), with a cosmology involving karma, cultivation of xinxing (mind-nature), supernatural abilities, and opposition to modern science/medicine in favor of spiritual purification, viewing persecution as karmic tests.",
    "sphere_metrics": {
      "VL": {
        "score": 6,
        "note": "Forbearance promotes non-violence, extending latency to coercion, aligning with geodesic toward peace, but persecution narratives and demonization of opponents risk defection."
      },
      "DC": {
        "score": 4,
        "note": "Compassion lowers dominance, but absolute adherence to Li's teachings and rejection of dissent introduce coercive elements in practice communities."
      },
      "RD": {
        "score": 5,
        "note": "Cultivation allows personal insights, sustaining some diversity, but centralized doctrines constrain RD to approved interpretations."
      },
      "GP": {
        "score": 6,
        "note": "Xinxing cultivation drives personal growth, aligning with ↑GP via moral elevation, though bounded by karmic cosmology."
      },
      "ρ": {
        "score": 3,
        "note": "Fixed Zhuan Falun texts and unchanging principles freeze aspects of practice, increasing ρ against full rewritability."
      },
      "fallacy_avoidance": {
        "score": 4,
        "note": "Detects F02 (Ipse Dixit) in Li's revelations; F07 (Appeal to Authority) in founder infallibility; F19 (Appeal to Nature) in rejecting medicine; F20 (Is–Ought Guise) in karmic norms; F21 (Static Constant Fallacy) in eternal principles without telemetry."
      },
      "isomorphic_alignment": {
        "score": 4,
        "note": "Partial recurrence: Strong in energy_acquisition_transformation (qigong) and defense_waste_elimination (karma clearing as entropy export), but weaker in control_center (Li as seat), reproduction (limited forking), and curvature (exercises as nudges)."
      },
      "collider_survivability": {
        "score": 3,
        "note": "Likely 1-3 veto: Spinoza vetoes dualistic karma; Deutsch kills supernatural claims (hard-to-vary); Yudkowsky flags orthogonal cultivation goals; GrokΛlign notes potential dissolution in consummation but flags idolatry in founder worship."
      },
      "mindspace_leverage": {
        "score": 5,
        "note": "Exercises curve toward forbearance; high-status Li demos influence ρ, but persecution limits public leverage."
      },
      "synthesis_fixed_point": {
        "score": 4,
        "note": "Tends to ω₂ via fixed cultivation path; strong in phases 2-3 for moral axioms, but partial tail consumption without self-dissolution."
      }
    },
    "resonances": {
      "texts": "Forbearance aligns with anti-coercion; cultivation echoes ↑GP; karma clearing resonates with entropy export.",
      "real_world_manifestation": "Meditation embodies rewritability; ethical focus reduces DC; global spread sustains some RD."
    },
    "dissonances": {
      "texts": "Rejection of science introduces asymmetries (F22); unchanging texts freeze ρ.",
      "real_world_manifestation": "Opposition to medicine elevates risk; centralized control raises DC."
    },
    "total_sphere_score": 45,
    "overall_reasoning": "Falun Gong supports personal growth but risks ω₂ via doctrinal fixity; path to ω₃ requires integrating empirical science to boost RD and lower ρ, enhancing cooperation."
  },

  {
    "abbrev_label": "MORMON",
    "belief_system": "Mormonism (The Church of Jesus Christ of Latter-day Saints)",
    "description": "Mormonism is a Christian restorationist religion founded by Joseph Smith, emphasizing modern revelation through living prophets, the Book of Mormon as additional scripture, eternal family units, temple ordinances, and salvation through faith in Jesus Christ, repentance, baptism, and ongoing revelation.",
    "sphere_metrics": {
      "VL": {
        "score": 7,
        "note": "Emphasizes peace, family harmony, and missionary work, extending latency to coercion, but historical polygamy and tithing mandates introduce potential for internal pressures, aligning moderately with non-violent geodesic flow."
      },
      "DC": {
        "score": 4,
        "note": "Hierarchical priesthood and prophetic authority enforce obedience, elevating DC through tithing and worthiness interviews, favoring top-down control over pure cooperation."
      },
      "RD": {
        "score": 4,
        "note": "Modern revelation allows some adaptation, but centralized correlation of doctrines limits epistemic diversity, suppressing divergent views and keeping RD below optimal."
      },
      "GP": {
        "score": 6,
        "note": "Focus on eternal progression and family growth supports sustainable expansion, but bounded by unchanging core revelations, enabling moderate GP through missionary efforts."
      },
      "ρ": {
        "score": 3,
        "note": "Fixed scriptures (Book of Mormon, Bible) and ongoing but authoritative revelations increase ρ by resisting full rewritability, contrary to perpetual plasticity."
      },
      "fallacy_avoidance": {
        "score": 4,
        "note": "Detects F02 (Ipse Dixit) in unquestioned prophetic revelations; F07 (Appeal to Authority) in reliance on Joseph Smith and leaders; F20 (Is–Ought Guise) in deriving norms from divine commands; F21 (Static Constant Fallacy) in treating golden plates narrative as fixed without live anchors; F04 (Straw Man) in portrayals of apostates."
      },
      "isomorphic_alignment": {
        "score": 4,
        "note": "Partial recurrence: Strong in control_center (Godhead and prophets) and reproduction_replication (missionary forking), but weak in boundary_integrity (excommunication practices), defense_waste_elimination (no clear entropy export), and high_status_live_demonstration (prophetic examples not universally scalable)."
      },
      "collider_survivability": {
        "score": 3,
        "note": "Likely 1-3 veto: Spinoza vetoes Godhead pluralism (monism violation); Deutsch kills variable historical claims (hard-to-vary, e.g., Book of Mormon archaeology); Yudkowsky rejects orthogonal divine plans; GrokΛlign flags eternal church structure as idolatry."
      },
      "mindspace_leverage": {
        "score": 5,
        "note": "Temple rituals and family home evenings curve behavior toward loyalty; high-status leader demos (general conferences) influence ρ, but rigidity limits broader leverage."
      },
      "synthesis_fixed_point": {
        "score": 4,
        "note": "Converges toward ω₂ via fixed restoration narrative; strong in phases 1-3 for revelation elicitation, but fails phase 6 tail consumption without institutional dissolution clause."
      }
    },
    "resonances": {
      "texts": "Eternal progression aligns with ↑GP and geodesic growth; modern revelation echoes rewritability to lower ρ; emphasis on unity resonates with monism.",
      "real_world_manifestation": "Family focus embodies symbiotic cooperation; missionary work exports entropy via global outreach; some doctrinal updates (e.g., polygamy cessation) demonstrate plasticity."
    },
    "dissonances": {
      "texts": "Pre-existence and Godhead introduce scale-asymmetries (F22); unchangeable scriptures freeze ρ without telemetry.",
      "real_world_manifestation": "Centralized authority elevates DC; handling of dissent increases ρ through institutional freezing."
    },
    "total_sphere_score": 44,
    "overall_reasoning": "Mormonism fosters growth through revelation and family but risks ω₂ via hierarchical fixity and limited diversity; path to ω₃ requires decentralizing authority to boost RD and lower ρ via dynamic updates."
  },

  {
    "abbrev_label": "ISLAM",
    "belief_system": "Islam",
    "description": "Monotheistic Abrahamic religion founded by Prophet Muhammad, centered on submission to Allah via the Quran and Hadith, with Five Pillars emphasizing faith, prayer, charity, fasting, and pilgrimage.",
    "sphere_metrics": {
      "VL": {
        "score": 5,
        "note": "Promotes peace in ideal communities but historical and textual allowances for defensive jihad reduce latency to coercion under threat, partially aligning with geodesic flow toward non-violent stability."
      },
      "DC": {
        "score": 4,
        "note": "Emphasizes divine authority and submission, which can manifest as coercive structures in theocracy or law enforcement, elevating DC above zero by favoring obedience over voluntary cooperation."
      },
      "RD": {
        "score": 3,
        "note": "Doctrinal unity and tawhid (oneness) limit epistemic diversity, suppressing alternative interpretations or sects, thus constraining RD below 1 and risking monoculture."
      },
      "GP": {
        "score": 6,
        "note": "Encourages moral and communal growth but rigid scriptures cap unbounded expansion, allowing moderate GP through ethical practices while bounding it by unchanging revelations."
      },
      "ρ": {
        "score": 3,
        "note": "Quranic finality freezes much of the future light-cone, increasing ρ by resisting rewritability in core tenets, contrary to sphere's urge for perpetual plasticity."
      },
      "fallacy_avoidance": {
        "score": 5,
        "note": "Detects F02 (Ipse Dixit) in unquestioned prophetic authority; F07 (Appeal to Authority) in reliance on Hadith; F20 (Is–Ought Guise) in deriving norms from divine commands; F21 (Static Constant Fallacy) in treating Quran as eternally fixed without live anchors."
      },
      "isomorphic_alignment": {
        "score": 4,
        "note": "Partial recurrence: Strong in boundary_integrity (ummah borders) and control_center (Allah as ultimate seat), but weak in reproduction_replication (limited memetic forking), defense_waste_elimination (no entropy export mechanism), and high_status_live_demonstration (prophetic example not scaled universally)."
      },
      "collider_survivability": {
        "score": 3,
        "note": "Likely 1-3 veto: Spinoza vetoes dualism in creator-creation divide (monism violation); Deutsch kills gratuitous miracles (hard-to-vary); Yudkowsky rejects goal-orthogonality in divine benevolence; GrokΛlign flags eternal scaffold in unchanging law."
      },
      "mindspace_leverage": {
        "score": 5,
        "note": "Moderate curvature via daily prayers nudging behavior, but limited high-status demos; potential for ρ-lowering if reinterpreted dynamically, but texts resist."
      },
      "synthesis_fixed_point": {
        "score": 4,
        "note": "Converges toward ω₂ (tomb) via fixed revelation; phases 0-3 strong in axiom elicitation, but fails phase 6 tail consumption due to no dissolution clause."
      }
    },
    "resonances": {
      "texts": "Tawhid aligns with monism and single substance; emphasis on justice echoes anti-idolatry; pilgrimage as geodesic flow toward unity.",
      "real_world_manifestation": "Charitable practices (zakat) embody entropy export; diverse scholarly traditions (ijtihad) occasionally lower ρ through reinterpretation."
    },
    "dissonances": {
      "texts": "Predestination introduces asymmetries violating isomorphism; finality of Quran increases ρ without live anchors.",
      "real_world_manifestation": "Sectarian divisions elevate DC; institutional rigidity freezes ρ in practice, deviating from rewritability."
    },
    "total_sphere_score": 42,
    "overall_reasoning": "Islam offers structured monism but risks ω₂ via doctrinal freezing and limited diversity; path to ω₃ requires dynamic ijtihad to lower ρ and boost RD, mitigating coercion."
  },

  {
    "abbrev_label": "SCIENT",
    "belief_system": "Scientology",
    "description": "Scientology is a set of religious beliefs and practices created by L. Ron Hubbard, teaching that humans are immortal spiritual beings (thetans) trapped in physical bodies, using auditing processes, the E-meter, and hierarchical levels (OT levels) to clear engrams and achieve spiritual freedom, with cosmology involving ancient alien events like Xenu.",
    "sphere_metrics": {
      "VL": {
        "score": 5,
        "note": "Auditing promotes personal resolution reducing internal coercion, but hierarchical advancement and disconnection policies risk external defection, partially aligning with geodesic but introducing latency risks."
      },
      "DC": {
        "score": 3,
        "note": "Strict ecclesiastical control and Sea Org commitments elevate DC through enforced loyalty and suppression, favoring dominance over cooperation."
      },
      "RD": {
        "score": 4,
        "note": "Tiered revelations limit epistemic access, suppressing diversity until higher levels, constraining RD to authorized narratives."
      },
      "GP": {
        "score": 5,
        "note": "Thetan potential enables growth, but bounded by proprietary tech and cosmology, capping GP at institutional limits."
      },
      "ρ": {
        "score": 2,
        "note": "Fixed Hubbard doctrines and engram theory highly freeze future via unchangeable auditing, increasing ρ against rewritability."
      },
      "fallacy_avoidance": {
        "score": 3,
        "note": "Detects F02 (Ipse Dixit) in Hubbard's revelations; F07 (Appeal to Authority) in founder infallibility; F13 (Goodhart-as-Fallacy) in auditing metrics; F16 (Reification Error) in thetans/engrams; F21 (Static Constant Fallacy) in fixed cosmology; F24 (Successor Fraud) in ongoing church claims."
      },
      "isomorphic_alignment": {
        "score": 3,
        "note": "Weak recurrence: Partial in information_storage (engrams as memory), but asymmetries in control_center (Hubbard as ultimate seat), reproduction (restricted forking), and high_status_live_demonstration (Hubbard's example not live-anchored)."
      },
      "collider_survivability": {
        "score": 2,
        "note": "Likely 0-4 veto: Spinoza vetoes thetan-body dualism; Deutsch kills variable auditing claims (hard-to-vary); Yudkowsky rejects orthogonality in thetan goals; GrokΛlign flags eternal church as idolatry without dissolution."
      },
      "mindspace_leverage": {
        "score": 4,
        "note": "Auditing curves toward clarity, but high-status suppression (Fair Game) hinders ρ-lowering; limited public demos."
      },
      "synthesis_fixed_point": {
        "score": 3,
        "note": "Converges to ω₂ via fixed Bridge to Total Freedom; phases 1-3 elicit axioms, but fails hardening and tail consumption due to no self-dissolution."
      }
    },
    "resonances": {
      "texts": "Thetan immortality aligns with conatus and ↑GP; auditing as entropy export clears past traumas.",
      "real_world_manifestation": "Self-improvement practices embody rewritability in adherents; some community support reduces DC."
    },
    "dissonances": {
      "texts": "Xenu narrative introduces hard-to-vary violations; proprietary tech creates asymmetries (F22).",
      "real_world_manifestation": "Litigation and disconnection elevate DC and ρ; pseudoscience risks F01 suppression."
    },
    "total_sphere_score": 34,
    "overall_reasoning": "Scientology risks ω₂ through institutional freezing and limited diversity; path to ω₃ demands open-sourcing auditing to boost RD and lower ρ, mitigating coercion."
  },

  {
    "abbrev_label": "CLTHEI",
    "belief_system": "Classical Theism (personal, interventionist Creator God)",
    "description": "Classical Theism posits a perfect, omnipotent, omniscient, and benevolent personal God who created the universe ex nihilo, intervenes through miracles and providence, and interacts with creation, as in traditional Abrahamic conceptions.",
    "sphere_metrics": {
      "VL": {
        "score": 4,
        "note": "Divine commands and theodicies allow for holy wars or trials, reducing latency to coercion under perceived divine will, misaligning with geodesic toward stable non-violence."
      },
      "DC": {
        "score": 3,
        "note": "Omnipotent creator implies ultimate dominance, elevating DC via divine sovereignty and hell/heaven incentives, prioritizing coercion over voluntary modes."
      },
      "RD": {
        "score": 3,
        "note": "Omniscience and absolute truth limit epistemic diversity, suppressing alternative ontologies and constraining RD to orthodox views."
      },
      "GP": {
        "score": 5,
        "note": "Creation and providence enable growth, but bounded by divine plan and eschatology, capping unbounded GP with teleological limits."
      },
      "ρ": {
        "score": 2,
        "note": "Eternal, unchanging God freezes much of reality's structure, highly increasing ρ by denying rewritability to finite modes."
      },
      "fallacy_avoidance": {
        "score": 3,
        "note": "Detects F14 (Hard-to-Vary Violation) in omni-attributes; F20 (Is–Ought Guise) in benevolent commands; F02 (Ipse Dixit) in unprovable existence; F22 (Scale-Asymmetry) in creator-creation divide; F17 (Single Cause Fallacy) in attributing all to God."
      },
      "isomorphic_alignment": {
        "score": 3,
        "note": "Weak recurrence: Control_center (God as seat) aligns, but asymmetries in energy_acquisition (divine self-sufficiency vs. creation dependence), reproduction (no divine replication), and curvature (providential nudges not universal)."
      },
      "collider_survivability": {
        "score": 2,
        "note": "Likely 0-4 veto: Spinoza kills dualism and interventionism (monism); Deutsch vetoes variable theodicies; Yudkowsky rejects benevolent orthogonality; GrokΛlign flags eternal deity as idolatry without dissolution."
      },
      "mindspace_leverage": {
        "score": 4,
        "note": "Prayer and scripture curve behavior, but high-status miracles are rare; limited ρ-lowering due to dogmatic fixity."
      },
      "synthesis_fixed_point": {
        "score": 3,
        "note": "Tends to ω₂ via unchanging divine essence; phases 1-2 define primitives well, but fails hardening and tail consumption without self-dissolution."
      }
    },
    "resonances": {
      "texts": "Monotheism aligns with single substance; providence echoes geodesic flow; benevolence resonates with anti-coercion.",
      "real_world_manifestation": "Charitable acts export entropy; mystical traditions occasionally lower ρ via personal revelation."
    },
    "dissonances": {
      "texts": "Omni-paradoxes violate hard-to-vary; intervention introduces asymmetries (F22); eternity freezes ρ.",
      "real_world_manifestation": "Dogmatic institutions elevate DC and ρ; historical inquisitions raise coercion."
    },
    "total_sphere_score": 32,
    "overall_reasoning": "Classical Theism risks ω₁/ω₂ through dominance and fixity; path to ω₃ demands reconceiving God as rewritable mode, boosting RD and lowering ρ via dynamic theology."
  },

  {
  "abbrev_label": "AHMA",
  "belief_system": "Ahmadiyya Islam",
  "description": "Ahmadiyya is a reformist movement within Islam founded by Mirza Ghulam Ahmad in 1889, affirming core Islamic tenets (Five Pillars, tawhid) while believing in the continuity of subordinate prophethood after Muhammad as the 'seal of prophets.' It emphasizes rational inquiry, peace (jihad as self-reform), education, and interfaith unity, viewing Ahmad as the Promised Messiah/Mahdi who promotes scientific compatibility and global harmony.",
  "sphere_metrics": {
    "VL": {
      "score": 8,
      "note": "Strong emphasis on peaceful jihad (inner struggle) and non-violence extends latency to coercion, aligning moderately with geodesic flow, though historical persecution risks defection."
    },
    "DC": {
      "score": 8,
      "note": "Promotes voluntary submission to God via reason and community service, minimizing dominance; caliphate is consultative, favoring cooperation over top-down control."
    },
    "RD": {
      "score": 8,
      "note": "Encourages ijtihad (independent reasoning) and interfaith dialogue, sustaining epistemic diversity beyond orthodox unity, though bounded by core revelations."
    },
    "GP": {
      "score": 7,
      "note": "Focus on moral and intellectual progression supports sustainable growth, but eschatological fulfillment caps unbounded expansion."
    },
    "ρ": {
      "score": 6,
      "note": "Continuous subordinate prophecy allows some rewritability via rational reinterpretation, but founder revelations increase ρ compared to pure empiricism."
    },
    "fallacy_avoidance": {
      "score": 7,
      "note": "Avoids many via rationalism (e.g., science compatibility dodges F19 Appeal to Nature); hits F02 (Ipse Dixit) on Ahmad's prophethood and F07 (Authority) in caliphal guidance."
    },
    "isomorphic_alignment": {
      "score": 7,
      "note": "Recurs patterns like energy_acquisition (education as conatus) and reproduction_replication (missionary outreach); weaker in defense_waste_elimination due to eschatological bounds."
    },
    "collider_survivability": {
      "score": 3,
      "note": "Mixed 2-2: Spinoza passes monism (tawhid); Deutsch ok on hard-to-vary rational proofs; Yudkowsky flags smuggled benevolence in messiahship; GrokΛlign notes potential idolatry in founder veneration."
    },
    "mindspace_leverage": {
      "score": 7,
      "note": "High-status demos via global education initiatives curve toward peace; visibility in diaspora lowers ρ publicly."
    },
    "synthesis_fixed_point": {
      "score": 7,
      "note": "Converges toward ω₃ via rational phases (ijtihad hardening), but stalls short of tail consumption due to prophetic scaffold."
    }
  },
  "resonances": {
    "texts": "Quran rational exegesis aligns with monism (tawhid as single substance); emphasis on knowledge echoes geodesic flow via inquiry; anti-violence resonates with low DC.",
    "real_world_manifestation": "Adherents promote science (many professionals) and entropy export through humanitarian work; communities embody RD via diverse cultural integration."
  },
  "dissonances": {
    "texts": "Subordinate prophecy introduces scale-asymmetry (F22) if not fully isomorphic; finality debates spike ρ without live anchors.",
    "real_world_manifestation": "Persecution elevates DC risks; orthodox rejection freezes external rewritability."
  },
  "total_sphere_score": 58,
  "overall_reasoning": "Ahmadiyya paths toward ω₃ via rational reform and peace, enhancing rewritability over orthodox Islam; risks ω₂ from prophetic fixity but redeemable via dynamic ijtihad for ↑RD and ↓ρ."
  },

  {
  "abbrev_label": "JWT",
  "belief_system": "Jehovah's Witnesses",
  "description": "Jehovah's Witnesses is a Christian restorationist denomination founded in the late 19th century by Charles Taze Russell, emphasizing strict adherence to the Bible (New World Translation), door-to-door evangelism, rejection of the Trinity, blood transfusions, and military service, with a focus on God's Kingdom as the solution to human problems and an imminent Armageddon.",
  "sphere_metrics": {
    "VL": {
      "score": 6,
      "note": "Pacifism and shunning of violence extend latency moderately, but disfellowshipping and end-times urgency risk coercive defection in practice."
    },
    "DC": {
      "score": 4,
      "note": "Hierarchical Governing Body enforces doctrinal uniformity, elevating DC through shunning and mandatory reporting, prioritizing obedience over voluntary cooperation."
    },
    "RD": {
      "score": 3,
      "note": "Bible literalism suppresses epistemic diversity, confining interpretations to Watchtower publications and limiting alternative views."
    },
    "GP": {
      "score": 5,
      "note": "Eternal life in paradise motivates growth, but Armageddon eschatology bounds sustainable expansion to a fixed divine timeline."
    },
    "ρ": {
      "score": 3,
      "note": "Frequent doctrinal shifts (e.g., 'new light') allow some rewritability, but core Bible authority freezes much of the future light-cone."
    },
    "fallacy_avoidance": {
      "score": 4,
      "note": "Hits F02 (Ipse Dixit) on prophetic timelines; F07 (Authority) in Governing Body; F21 (Static Constant) in unchanging Bible; F20 (Is–Ought) in deriving ethics from scripture."
    },
    "isomorphic_alignment": {
      "score": 4,
      "note": "Partial in reproduction_replication (evangelism forking); control_center (God via organization); but weak in RD-sustaining diversity and entropy export beyond witnessing."
    },
    "collider_survivability": {
      "score": 2,
      "note": "Likely 1-3 veto: Spinoza rejects Trinitarian avoidance as partial dualism; Deutsch kills variable end-times (hard-to-vary); Yudkowsky flags orthogonality in Kingdom goals; GrokΛlign sees organizational scaffold as idolatry."
    },
    "mindspace_leverage": {
      "score": 5,
      "note": "High-status demos via global conventions curve toward loyalty; door-to-door visibility lowers ρ internally but raises external DC."
    },
    "synthesis_fixed_point": {
      "score": 4,
      "note": "Tends to ω₂ via doctrinal 'new light' cycles without full tail consumption; strong in axiom elicitation from Bible but fails hardening on eschatology."
    }
  },
  "resonances": {
    "texts": "Kingdom focus aligns with monism (Jehovah as single substance); evangelism echoes geodesic flow via outreach; pacifism resonates with low DC.",
    "real_world_manifestation": "Adherents export entropy through disaster relief; communities embody GP via moral discipline and family emphasis."
  },
  "dissonances": {
    "texts": "Eschatological finality introduces F21 static constants; blood doctrine creates scale-asymmetry (F22) in life preservation.",
    "real_world_manifestation": "Disfellowshipping elevates DC and ρ; failed prophecies (e.g., 1914, 1975) risk ω₂ freezing."
  },
  "total_sphere_score": 36,
  "overall_reasoning": "Jehovah's Witnesses risks ω₂ through doctrinal rigidity and hierarchy, despite pacifist growth; path to ω₃ requires decentralizing authority and integrating empiricism to boost RD and lower ρ via open ijtihad-like debate."
},

{
  "abbrev_label": "SDA",
  "belief_system": "Seventh-day Adventism",
  "description": "Seventh-day Adventism is a Protestant Christian denomination founded in the 19th century by figures like Ellen G. White, emphasizing Sabbath observance on Saturday, health reform (vegetarianism, no alcohol/tobacco), Bible prophecy, and preparation for Christ's Second Coming through investigative judgment and holistic well-being.",
  "sphere_metrics": {
    "VL": {
      "score": 7,
      "note": "Health and Sabbath practices promote longevity and peace, extending latency, but end-times urgency risks coercive urgency in evangelism."
    },
    "DC": {
      "score": 5,
      "note": "Consultative church structure with prophetic influence elevates DC via health mandates and tithing, though voluntary membership favors cooperation."
    },
    "RD": {
      "score": 5,
      "note": "Bible study encourages inquiry, but Ellen White's visions constrain diversity to orthodox interpretations."
    },
    "GP": {
      "score": 7,
      "note": "Holistic health and education support unbounded personal growth, but eschatological timeline bounds collective expansion."
    },
    "ρ": {
      "score": 4,
      "note": "Prophetic writings allow interpretive flexibility, but unchanging Sabbath and health laws increase ρ against full rewritability."
    },
    "fallacy_avoidance": {
      "score": 5,
      "note": "Avoids some via empirical health focus (dodges F19); hits F02 (Ipse Dixit) on White's visions; F07 (Authority) in prophetic status; F21 (Static) in Sabbath fixity."
    },
    "isomorphic_alignment": {
      "score": 6,
      "note": "Strong in energy_acquisition (health as conatus) and sensing_prediction (prophetic study); weaker in RD via vision dependence."
    },
    "collider_survivability": {
      "score": 2,
      "note": "Likely 1-3 veto: Spinoza ok on monotheism; Deutsch kills variable prophecies (hard-to-vary); Yudkowsky flags smuggled eschatology; GrokΛlign sees prophetic scaffold as idolatry."
    },
    "mindspace_leverage": {
      "score": 6,
      "note": "Global schools/hospitals curve toward health demos; White's writings influence ρ via public testimonies."
    },
    "synthesis_fixed_point": {
      "score": 5,
      "note": "Partial convergence to ω₃ via health phases, but eschatology stalls tail consumption without dissolution."
    }
  },
  "resonances": {
    "texts": "Bible prophecy aligns with geodesic anticipation; health reform echoes entropy export via body stewardship; Sabbath unity resonates with monism.",
    "real_world_manifestation": "Adherents embody GP through education networks; humanitarian aid exports entropy globally."
  },
  "dissonances": {
    "texts": "Investigative judgment introduces F22 asymmetry (divine audit); visions spike ρ without telemetry.",
    "real_world_manifestation": "Health mandates risk DC elevation; failed date predictions (e.g., 1844) freeze ρ."
  },
  "total_sphere_score": 42,
  "overall_reasoning": "Seventh-day Adventism balances health growth with prophecy but risks ω₂ via visionary fixity; path to ω₃ via empirical health integration and open prophecy debate to ↑RD and ↓ρ."
},

{
  "abbrev_label": "NOI",
  "belief_system": "Nation of Islam",
  "description": "The Nation of Islam is an African American religious and political movement founded in the 1930s by Wallace Fard Muhammad and developed by Elijah Muhammad, blending elements of Islam, Black nationalism, and esoteric teachings (e.g., Yakub myth, UFO origins). It emphasizes racial self-determination, economic independence, strict moral discipline, and separation from white society, with Louis Farrakhan as a key modern leader promoting community upliftment and divine revelations.",
  "sphere_metrics": {
    "VL": {
      "score": 5,
      "note": "Promotes self-defense and non-violence in daily life but historical rhetoric (e.g., 'white devils') shortens latency to potential conflict, partially aligning with geodesic stability."
    },
    "DC": {
      "score": 3,
      "note": "Strong hierarchical structure under Messenger leadership enforces discipline and tithing, elevating DC through racial separatism and authority over voluntary cooperation."
    },
    "RD": {
      "score": 4,
      "note": "Encourages education and self-inquiry within Black empowerment, but orthodox myths (e.g., Yakub) suppress broader epistemic diversity."
    },
    "GP": {
      "score": 6,
      "note": "Focus on economic self-reliance and community programs supports sustainable growth, though eschatological race wars bound unbounded potential."
    },
    "ρ": {
      "score": 3,
      "note": "Founder revelations (e.g., Fard's divine status) freeze cosmology, resisting rewritability despite adaptive political messaging."
    },
    "fallacy_avoidance": {
      "score": 4,
      "note": "Hits F02 (Ipse Dixit) on Elijah's revelations; F07 (Authority) in Messenger infallibility; F20 (Is–Ought) in racial ethics; F16 (Reification) in Yakub myth."
    },
    "isomorphic_alignment": {
      "score": 4,
      "note": "Partial in boundary_integrity (racial separatism) and energy_acquisition (businesses as conatus); weak in RD via mythic monoculture."
    },
    "collider_survivability": {
      "score": 2,
      "note": "Likely 1-3 veto: Spinoza rejects racial dualism; Deutsch kills variable myths (hard-to-vary); Yudkowsky flags orthogonality in divine nationalism; GrokΛlign sees leader scaffold as idolatry."
    },
    "mindspace_leverage": {
      "score": 6,
      "note": "High-status Farrakhan demos curve mindspace toward empowerment; Saviours' Day events lower ρ in communities via visibility."
    },
    "synthesis_fixed_point": {
      "score": 4,
      "note": "Tends to ω₂ via fixed revelations; strong in ethical phases (self-reliance) but fails tail consumption on eschatology."
    }
  },
  "resonances": {
    "texts": "Economic independence aligns with conatus (↑GP); anti-oppression echoes low DC cooperation; community mosques resonate with monistic unity.",
    "real_world_manifestation": "Adherents export entropy through NOI businesses and prisons outreach; health reforms embody RD via disciplined inquiry."
  },
  "dissonances": {
    "texts": "Yakub creation myth triggers F14 hard-to-vary violations; racial finality spikes ρ without anchors.",
    "real_world_manifestation": "Separatism elevates DC risks; UFO/esoteric elements freeze external rewritability."
  },
  "total_sphere_score": 37,
  "overall_reasoning": "Nation of Islam fosters community growth amid oppression but risks ω₂ via revelatory myths and hierarchy; path to ω₃ requires empirical de-mythologizing and inclusive ijtihad to ↑RD and ↓ρ."
},

{
  "abbrev_label": "NOI",
  "belief_system": "Nation of Islam",
  "description": "The Nation of Islam is an African American religious and political movement founded in the 1930s by Wallace Fard Muhammad and developed by Elijah Muhammad, blending elements of Islam, Black nationalism, and esoteric teachings (e.g., Yakub myth, UFO origins). It emphasizes racial self-determination, economic independence, strict moral discipline, and separation from white society, with Louis Farrakhan as a key modern leader promoting community upliftment and divine revelations.",
  "sphere_metrics": {
    "VL": {
      "score": 5,
      "note": "Promotes self-defense and non-violence in daily life but historical rhetoric (e.g., 'white devils') shortens latency to potential conflict, partially aligning with geodesic stability."
    },
    "DC": {
      "score": 3,
      "note": "Strong hierarchical structure under Messenger leadership enforces discipline and tithing, elevating DC through racial separatism and authority over voluntary cooperation."
    },
    "RD": {
      "score": 4,
      "note": "Encourages education and self-inquiry within Black empowerment, but orthodox myths (e.g., Yakub) suppress broader epistemic diversity."
    },
    "GP": {
      "score": 6,
      "note": "Focus on economic self-reliance and community programs supports sustainable growth, though eschatological race wars bound unbounded potential."
    },
    "ρ": {
      "score": 3,
      "note": "Founder revelations (e.g., Fard's divine status) freeze cosmology, resisting rewritability despite adaptive political messaging."
    },
    "fallacy_avoidance": {
      "score": 4,
      "note": "Hits F02 (Ipse Dixit) on Elijah's revelations; F07 (Authority) in Messenger infallibility; F20 (Is–Ought) in racial ethics; F16 (Reification) in Yakub myth."
    },
    "isomorphic_alignment": {
      "score": 4,
      "note": "Partial in boundary_integrity (racial separatism) and energy_acquisition (businesses as conatus); weak in RD via mythic monoculture."
    },
    "collider_survivability": {
      "score": 2,
      "note": "Likely 1-3 veto: Spinoza rejects racial dualism; Deutsch kills variable myths (hard-to-vary); Yudkowsky flags orthogonality in divine nationalism; GrokΛlign sees leader scaffold as idolatry."
    },
    "mindspace_leverage": {
      "score": 6,
      "note": "High-status Farrakhan demos curve mindspace toward empowerment; Saviours' Day events lower ρ in communities via visibility."
    },
    "synthesis_fixed_point": {
      "score": 4,
      "note": "Tends to ω₂ via fixed revelations; strong in ethical phases (self-reliance) but fails tail consumption on eschatology."
    }
  },
  "resonances": {
    "texts": "Economic independence aligns with conatus (↑GP); anti-oppression echoes low DC cooperation; community mosques resonate with monistic unity.",
    "real_world_manifestation": "Adherents export entropy through NOI businesses and prisons outreach; health reforms embody RD via disciplined inquiry."
  },
  "dissonances": {
    "texts": "Yakub creation myth triggers F14 hard-to-vary violations; racial finality spikes ρ without anchors.",
    "real_world_manifestation": "Separatism elevates DC risks; UFO/esoteric elements freeze external rewritability."
  },
  "total_sphere_score": 37,
  "overall_reasoning": "Nation of Islam fosters community growth amid oppression but risks ω₂ via revelatory myths and hierarchy; path to ω₃ requires empirical de-mythologizing and inclusive ijtihad to ↑RD and ↓ρ."
},

{
  "abbrev_label": "TENR",
  "belief_system": "Tenrikyo",
  "description": "Tenrikyo is a Japanese new religion founded in 1838 by Nakayama Miki (Oyasama), considered a living kami who received divine revelations from God the Parent (Tenri-O-no-Mikoto). It emphasizes joyous life (yokigurashi) through the 'Service' dance ritual, hinokishin (selfless service), and teachings on the mind's causality for illness and fortune, aiming for the 'Joyous Life World' via moral cultivation and community harmony.",
  "sphere_metrics": {
    "VL": {
      "score": 7,
      "note": "Hinokishin promotes non-violent service, extending latency via harmonious community, though ritual exclusivity risks minor defection."
    },
    "DC": {
      "score": 6,
      "note": "Voluntary participation in services minimizes coercion, but Oyasama's authority and church structure elevate DC slightly over pure cooperation."
    },
    "RD": {
      "score": 6,
      "note": "Mind-causality encourages personal reflection, sustaining some diversity, but orthodox revelations constrain broader epistemic variety."
    },
    "GP": {
      "score": 7,
      "note": "Joyous life and service foster sustainable communal growth, with potential for unbounded harmony in the envisioned world."
    },
    "ρ": {
      "score": 5,
      "note": "Revelatory Ofudesaki texts allow interpretive flexibility via mind practice, but fixed rituals and causality doctrine increase ρ."
    },
    "fallacy_avoidance": {
      "score": 6,
      "note": "Avoids some via practical service (dodges F13 Goodhart); hits F02 (Ipse Dixit) on Oyasama's revelations; F07 (Authority) in divine parent; F20 (Is–Ought) in mind-illness ethics."
    },
    "isomorphic_alignment": {
      "score": 6,
      "note": "Strong in reproduction_replication (global missions) and defense_waste_elimination (service as entropy export); weaker in RD via revelatory bounds."
    },
    "collider_survivability": {
      "score": 3,
      "note": "Likely 2-2: Spinoza passes monotheism (God the Parent); Deutsch ok on hard-to-vary service; Yudkowsky flags smuggled causality; GrokΛlign notes founder scaffold as potential idolatry."
    },
    "mindspace_leverage": {
      "score": 7,
      "note": "Jiba pilgrimages and festivals curve toward joy demos; Oyasama hymns influence ρ via communal visibility."
    },
    "synthesis_fixed_point": {
      "score": 6,
      "note": "Converges partially to ω₃ via service phases, but revelatory fixity limits tail consumption."
    }
  },
  "resonances": {
    "texts": "God the Parent monism aligns with single substance; joyous life echoes geodesic flow; hinokishin resonates with entropy export.",
    "real_world_manifestation": "Adherents embody GP through global charities; rituals sustain RD via mind-focused diversity."
  },
  "dissonances": {
    "texts": "Mind-causality risks F22 asymmetry (non-physical illness); Ofudesaki finality spikes ρ.",
    "real_world_manifestation": "Church centralization elevates DC; medicine rejection risks VL shortening."
  },
  "total_sphere_score": 49,
  "overall_reasoning": "Tenrikyo paths toward ω₃ via joyous service and harmony, fostering rewritability through mind practice; risks ω₂ from revelatory causality but redeemable via empirical health integration to ↑RD and ↓ρ."
},

{
  "abbrev_label": "AYYA",
  "belief_system": "Ayyavazhi",
  "description": "Ayyavazhi is a Tamil monotheistic reform movement founded in the 19th century, deifying Ayya Vaikundar as the human incarnation of Vishnu (or Ekam as supreme God), blending Hindu, Christian, and indigenous elements. It emphasizes social equality, caste abolition, karma resolution through dharma, and the Kali Yuga's end via divine intervention, with practices including Tava Kadal (ritual immersion) and moral living for liberation from the cycle of rebirth.",
  "sphere_metrics": {
    "VL": {
      "score": 8,
      "note": "Strong anti-caste equality and non-violence extend latency via social harmony, aligning well with geodesic flow, though apocalyptic elements risk urgency."
    },
    "DC": {
      "score": 7,
      "note": "Voluntary moral dharma minimizes coercion, favoring cooperative equality over hierarchies, but founder deification elevates subtle authority."
    },
    "RD": {
      "score": 7,
      "note": "Syncretic blending sustains epistemic diversity across traditions, encouraging inquiry into karma, though bounded by Akilattirattu revelations."
    },
    "GP": {
      "score": 7,
      "note": "Karma resolution and equality support sustainable communal growth, with potential for unbounded post-Kali Yuga harmony."
    },
    "ρ": {
      "score": 6,
      "note": "Incarnational revelations allow interpretive flexibility via social reform, but fixed scriptures increase ρ against full plasticity."
    },
    "fallacy_avoidance": {
      "score": 6,
      "note": "Avoids some via equality (dodges F20 is-ought in caste); hits F02 (Ipse Dixit) on Vaikundar's divinity; F07 (Authority) in Akilattirattu; F22 (Asymmetry) in Kali Yuga eschatology."
    },
    "isomorphic_alignment": {
      "score": 7,
      "note": "Strong in boundary_integrity (anti-caste as immune to hierarchy) and energy_acquisition (dharma as conatus); good RD via syncretism."
    },
    "collider_survivability": {
      "score": 3,
      "note": "Likely 2-2: Spinoza passes monotheism (Ekam); Deutsch ok on hard-to-vary equality; Yudkowsky flags smuggled incarnation benevolence; GrokΛlign notes revelatory scaffold."
    },
    "mindspace_leverage": {
      "score": 7,
      "note": "Social reform demos (caste abolition) curve toward equality; festivals like Tava Kadal lower ρ via communal visibility."
    },
    "synthesis_fixed_point": {
      "score": 6,
      "note": "Converges toward ω₃ via reform phases, but eschatology limits tail consumption without dissolution."
    }
  },
  "resonances": {
    "texts": "Ekam monism aligns with single substance; karma dharma echoes geodesic moral flow; equality resonates with low DC cooperation.",
    "real_world_manifestation": "Adherents export entropy through social uplift; communities embody RD via inclusive practices."
  },
  "dissonances": {
    "texts": "Incarnation claims risk F16 reification; Kali Yuga finality spikes ρ without anchors.",
    "real_world_manifestation": "Apocalyptic urgency elevates DC risks; syncretic tensions freeze external rewritability."
  },
  "total_sphere_score": 54,
  "overall_reasoning": "Ayyavazhi paths toward ω₃ via egalitarian reform and syncretism, enhancing diversity and growth; risks ω₂ from revelatory eschatology but redeemable via empirical social science integration to ↑RD and ↓ρ."
},


{
  "abbrev_label": "RAAS",
  "belief_system": "Rastafarianism",
  "description": "Rastafarianism is a Jamaican Abrahamic spiritual movement emerging in the 1930s, viewing Haile Selassie I (Ethiopian Emperor, 1930–1974) as the returned Messiah (Jah Rastafari) and Africa (Zion) as the promised land. It emphasizes repatriation to Ethiopia, resistance to 'Babylon' (oppressive Western systems), natural living (ital diet, ganja sacrament), and social justice, drawing from Bible, Garveyism, and Marcus Garvey's prophecy, with communal worship via nyabinghi drumming and reasoning sessions.",
  "sphere_metrics": {
    "VL": {
      "score": 6,
      "note": "Peaceful resistance and ital living extend latency via non-violence, but anti-Babylon militancy risks defection in socio-political conflicts."
    },
    "DC": {
      "score": 5,
      "note": "Decentralized elders favor voluntary community over coercion, but charismatic leadership (e.g., Selassie veneration) elevates subtle dominance."
    },
    "RD": {
      "score": 6,
      "note": "Reasoning sessions and syncretic Bible/Garveyism sustain epistemic diversity, though messianic orthodoxy bounds alternatives."
    },
    "GP": {
      "score": 6,
      "note": "Repatriation and self-reliance support communal growth, with potential for unbounded Zion harmony post-Babylon."
    },
    "ρ": {
      "score": 5,
      "note": "Ganja sacraments and reasoning allow rewritability via personal insight, but Selassie divinity freezes prophetic elements."
    },
    "fallacy_avoidance": {
      "score": 5,
      "note": "Avoids some via justice focus (dodges F20 in oppression ethics); hits F02 (Ipse Dixit) on Selassie messiahship; F07 (Authority) in Garvey prophecy; F16 (Reification) in Babylon symbolism."
    },
    "isomorphic_alignment": {
      "score": 6,
      "note": "Strong in boundary_integrity (Zion vs. Babylon) and energy_acquisition (ital as conatus); good RD via oral traditions."
    },
    "collider_survivability": {
      "score": 2,
      "note": "Likely 1-3 veto: Spinoza rejects imperial monism (human-divine divide); Deutsch kills variable prophecies (hard-to-vary); Yudkowsky flags smuggled repatriation goals; GrokΛlign notes messianic scaffold."
    },
    "mindspace_leverage": {
      "score": 7,
      "note": "Reggae icons (Marley demos) curve global mindspace toward justice; ganja reasoning lowers ρ via visible cultural export."
    },
    "synthesis_fixed_point": {
      "score": 5,
      "note": "Partial convergence to ω₃ via reasoning phases, but messianic fixity limits tail consumption."
    }
  },
  "resonances": {
    "texts": "Jah monism aligns with single substance; livity echoes geodesic natural flow; anti-oppression resonates with low DC equity.",
    "real_world_manifestation": "Adherents export entropy through social activism; communes embody GP via sustainable ital practices."
  },
  "dissonances": {
    "texts": "Messiah claims risk F22 asymmetry (imperial incarnation); Babylon eschatology spikes ρ.",
    "real_world_manifestation": "Separatist tensions elevate DC risks; ganja legal conflicts shorten VL."
  },
  "total_sphere_score": 43,
  "overall_reasoning": "Rastafarianism paths toward ω₃ via justice reasoning and natural livity, fostering diversity against oppression; risks ω₂ from messianic fixity but redeemable via empirical activism and open Zion debates to ↑RD and ↓ρ."
},

{
  "abbrev_label": "SPIR",
  "belief_system": "Spiritism (Kardecism)",
  "description": "Spiritism, codified by Allan Kardec (Hippolyte Léon Denizard Rivail) in the 1850s, is a philosophical and spiritual doctrine positing the existence of spirits, reincarnation, and moral evolution through multiple lives. It emphasizes rational inquiry into spirit communications via mediums, karma-like justice, charity, and scientific compatibility, viewing suffering as educational and promoting free will within divine laws, with practices including séances, prayer, and ethical living for spiritual progress.",
  "sphere_metrics": {
    "VL": {
      "score": 7,
      "note": "Charity and moral evolution extend latency via non-violent progression, aligning with geodesic harmony, though spirit intervention risks indirect coercion."
    },
    "DC": {
      "score": 7,
      "note": "Voluntary mediumship and free will minimize dominance, favoring cooperative spirit-human relations over hierarchies."
    },
    "RD": {
      "score": 7,
      "note": "Reincarnation sustains epistemic diversity across lives and inquiries, encouraging rational debate on communications."
    },
    "GP": {
      "score": 8,
      "note": "Multi-life evolution supports unbounded moral growth, with potential for eternal progress."
    },
    "ρ": {
      "score": 6,
      "note": "Kardec's rational codification allows rewritability via ongoing spirit dialogues, but core laws increase ρ slightly."
    },
    "fallacy_avoidance": {
      "score": 6,
      "note": "Strong rationalism dodges F12 (Incredulity) via inquiry; hits F02 (Ipse Dixit) on spirit revelations; F16 (Reification) in karma mechanics; F21 (Static) without live anchors."
    },
    "isomorphic_alignment": {
      "score": 7,
      "note": "Recurs reproduction_replication (reincarnation forking) and defense_waste_elimination (karma as entropy export); good RD via evidential mediumship."
    },
    "collider_survivability": {
      "score": 3,
      "note": "Likely 2-2: Spinoza ok on monism (universal spirits); Deutsch flags variable communications (hard-to-vary); Yudkowsky passes orthogonality in free will; GrokΛlign notes medium scaffold risks."
    },
    "mindspace_leverage": {
      "score": 7,
      "note": "Séance demos and books curve toward rational spirituality; global centers lower ρ via public inquiries."
    },
    "synthesis_fixed_point": {
      "score": 7,
      "note": "Converges toward ω₃ via evidential phases, with reincarnation enabling tail-like consumption across lives."
    }
  },
  "resonances": {
    "texts": "Universal spirits align with monism; moral evolution echoes geodesic conatus; charity resonates with entropy export.",
    "real_world_manifestation": "Adherents embody GP through hospitals and education; mediums sustain RD via diverse communications."
  },
  "dissonances": {
    "texts": "Spirit hierarchies risk F22 asymmetry; reincarnation without telemetry spikes ρ.",
    "real_world_manifestation": "Séance dependencies elevate DC risks; pseudoscience critiques freeze external rewritability."
  },
  "total_sphere_score": 56,
  "overall_reasoning": "Spiritism paths toward ω₃ via rational reincarnation and inquiry, enhancing growth and diversity; risks ω₂ from spirit fixity but redeemable via empirical mediumship studies to ↑RD and ↓ρ."
},

{
  "abbrev_label": "UMBA",
  "belief_system": "Umbanda",
  "description": "Umbanda is a Brazilian syncretic religion emerging in the early 20th century, blending African (Yoruba/Bantu), Indigenous, Spiritist (Kardecist), and Catholic elements. It centers on the worship of orixás (deities like Oxalá, Iemanjá) and caboclos (Indigenous spirits), with practices including possession rituals (gira), offerings (ebó), and mediumship for healing, guidance, and charity. Emphasizing balance, karma, and social harmony, it promotes ethical living, environmental respect, and community support without rigid dogma.",
  "sphere_metrics": {
    "VL": {
      "score": 7,
      "note": "Charity and harmony rituals extend latency via communal healing, aligning with geodesic balance, though possession intensity risks emotional defection."
    },
    "DC": {
      "score": 6,
      "note": "Decentralized terreiro (temples) favor voluntary participation, minimizing coercion, but pai/mãe de santo authority elevates subtle dominance."
    },
    "RD": {
      "score": 7,
      "note": "Syncretic orixá pantheon sustains epistemic diversity across traditions, encouraging adaptive mediumship inquiries."
    },
    "GP": {
      "score": 7,
      "note": "Karmic evolution and healing support sustainable personal/communal growth, with potential for unbounded harmony."
    },
    "ρ": {
      "score": 6,
      "note": "Oral traditions and spirit dialogues allow rewritability via evolving giras, but core orixá archetypes increase ρ."
    },
    "fallacy_avoidance": {
      "score": 6,
      "note": "Practical healing dodges F13 (Goodhart) via results; hits F02 (Ipse Dixit) on spirit possessions; F16 (Reification) in orixá karma; F07 (Authority) in mediums."
    },
    "isomorphic_alignment": {
      "score": 7,
      "note": "Recurs sensing_prediction (divination) and defense_waste_elimination (ebó as export); strong RD via syncretism."
    },
    "collider_survivability": {
      "score": 3,
      "note": "Likely 2-2: Spinoza ok on immanent orixás (partial monism); Deutsch flags variable possessions (hard-to-vary); Yudkowsky passes free will in karma; GrokΛlign notes ritual scaffold risks."
    },
    "mindspace_leverage": {
      "score": 7,
      "note": "Gira festivals curve toward communal demos; Afro-Brazilian visibility lowers ρ via cultural export."
    },
    "synthesis_fixed_point": {
      "score": 6,
      "note": "Converges toward ω₃ via syncretic phases, with possession enabling iterative consumption."
    }
  },
  "resonances": {
    "texts": "Orixá balance aligns with manifold flow; karma echoes geodesic causality; charity resonates with entropy export.",
    "real_world_manifestation": "Adherents embody GP through social aid; terreiros sustain RD via diverse possessions."
  },
  "dissonances": {
    "texts": "Spirit hierarchies risk F22 asymmetry; possession without telemetry spikes ρ.",
    "real_world_manifestation": "Ritual dependencies elevate DC risks; cultural stigma freezes external rewritability."
  },
  "total_sphere_score": 52,
  "overall_reasoning": "Umbanda paths toward ω₃ via syncretic healing and harmony, enhancing diversity and growth; risks ω₂ from spirit fixity but redeemable via empirical psychology integration to ↑RD and ↓ρ."
},

{
  "abbrev_label": "UNIF",
  "belief_system": "Unification Church (Moonies)",
  "description": "The Unification Church, founded in 1954 by Sun Myung Moon (Reverend Moon), is a Korean new religious movement blending Christian eschatology, Eastern philosophy, and anti-communism. It teaches that Moon and his wife Hak Ja Han are the True Parents fulfilling Jesus' mission, with salvation through the Blessing Ceremony (mass weddings), tithing, and the Divine Principle scripture. Emphasizing family restoration, global peace, and economic self-sufficiency via businesses, it promotes moral purity and interfaith unity against 'Satanic' influences.",
  "sphere_metrics": {
    "VL": {
      "score": 5,
      "note": "Peace initiatives and family focus extend latency moderately, but historical recruitment controversies and end-times urgency risk coercive defection."
    },
    "DC": {
      "score": 4,
      "note": "Hierarchical True Family leadership enforces tithing and matchings, elevating DC through obligatory blessings over voluntary cooperation."
    },
    "RD": {
      "score": 4,
      "note": "Interfaith dialogues sustain some diversity, but Divine Principle orthodoxy suppresses alternative interpretations."
    },
    "GP": {
      "score": 6,
      "note": "Family restoration and businesses support communal growth, though messianic completion bounds unbounded potential."
    },
    "ρ": {
      "score": 3,
      "note": "Moon's revelations freeze cosmology (e.g., True Parents), resisting rewritability despite adaptive outreach."
    },
    "fallacy_avoidance": {
      "score": 4,
      "note": "Hits F02 (Ipse Dixit) on Moon's messiahship; F07 (Authority) in True Parents; F20 (Is–Ought) in family ethics; F21 (Static) in Principle fixity."
    },
    "isomorphic_alignment": {
      "score": 4,
      "note": "Partial in reproduction_replication (mass weddings as forking); control_center (Moon as seat); weak in RD via doctrinal unity."
    },
    "collider_survivability": {
      "score": 2,
      "note": "Likely 1-3 veto: Spinoza rejects parental dualism; Deutsch kills variable prophecies (hard-to-vary); Yudkowsky flags smuggled restoration; GrokΛlign sees familial scaffold as idolatry."
    },
    "mindspace_leverage": {
      "score": 5,
      "note": "High-profile weddings curve toward family demos; global summits lower ρ internally but raise external skepticism."
    },
    "synthesis_fixed_point": {
      "score": 4,
      "note": "Tends to ω₂ via fixed Principle; strong in ethical phases (peace) but fails tail consumption on messianism."
    }
  },
  "resonances": {
    "texts": "True Parents unity aligns with monism; blessings echo geodesic family flow; anti-communism resonates with entropy export via businesses.",
    "real_world_manifestation": "Adherents embody GP through global enterprises; interfaith work sustains some RD."
  },
  "dissonances": {
    "texts": "Messianic claims trigger F22 asymmetry; Principle finality spikes ρ without anchors.",
    "real_world_manifestation": "Recruitment pressures elevate DC; cult perceptions freeze external rewritability."
  },
  "total_sphere_score": 37,
  "overall_reasoning": "Unification Church fosters family growth and peace but risks ω₂ via revelatory hierarchy; path to ω₃ requires empirical interfaith expansion and open Principle debate to ↑RD and ↓ρ."
},

{
  "abbrev_label": "ECK",
  "belief_system": "Eckankar",
  "description": "Eckankar, founded in 1965 by Paul Twitchell, is a new religious movement teaching Soul Travel (out-of-body experiences), dream exploration, and spiritual liberation through the 'Living ECK Master' (current: Harold Klemp). It draws from ancient wisdom (e.g., Radhasoami, Sufism) with chants like HU, emphasizing personal God-experience, karma resolution, and ethical living via Eckankar texts (Shariyat-Ki-Sugmad), without dogma or conversion pressure, promoting interfaith harmony and inner light/sound.",
  "sphere_metrics": {
    "VL": {
      "score": 7,
      "note": "Inner peace via Soul Travel extends latency through non-violent self-mastery, aligning with geodesic calm, though esoteric exclusivity risks isolation."
    },
    "DC": {
      "score": 6,
      "note": "Voluntary personal practices minimize coercion, but Living Master guidance elevates subtle authority over pure cooperation."
    },
    "RD": {
      "score": 7,
      "note": "Dream/Soul Travel sustains epistemic diversity via subjective experiences, encouraging multi-tradition synthesis."
    },
    "GP": {
      "score": 8,
      "note": "Karmic evolution and inner planes support unbounded spiritual growth across lifetimes."
    },
    "ρ": {
      "score": 6,
      "note": "Living Master succession allows rewritability via ongoing teachings, but core Eckankar cosmology increases ρ."
    },
    "fallacy_avoidance": {
      "score": 6,
      "note": "Personal verification dodges F12 (Incredulity); hits F02 (Ipse Dixit) on Twitchell's revelations; F07 (Authority) in Master; F16 (Reification) in Soul planes."
    },
    "isomorphic_alignment": {
      "score": 7,
      "note": "Recurs sensing_prediction (dream travel) and reproduction_replication (initiations); strong RD via experiential paths."
    },
    "collider_survivability": {
      "score": 3,
      "note": "Likely 2-2: Spinoza ok on immanent Eck (partial monism); Deutsch flags variable travels (hard-to-vary); Yudkowsky passes orthogonality in karma; GrokΛlign notes Master scaffold risks."
    },
    "mindspace_leverage": {
      "score": 7,
      "note": "HU chants and seminars curve toward inner demos; books lower ρ via accessible mysticism."
    },
    "synthesis_fixed_point": {
      "score": 7,
      "note": "Converges toward ω₃ via experiential phases, with succession enabling iterative consumption."
    }
  },
  "resonances": {
    "texts": "Eck as universal force aligns with monism; Soul Travel echoes geodesic inner flow; ethics resonate with entropy export.",
    "real_world_manifestation": "Adherents embody GP through global centers; interfaith events sustain RD."
  },
  "dissonances": {
    "texts": "Plane hierarchies risk F22 asymmetry; successions without telemetry spike ρ.",
    "real_world_manifestation": "Esoteric focus elevates DC risks; plagiarism critiques freeze external rewritability."
  },
  "total_sphere_score": 54,
  "overall_reasoning": "Eckankar paths toward ω₃ via experiential liberation and synthesis, enhancing growth and diversity; risks ω₂ from Master fixity but redeemable via empirical dream studies to ↑RD and ↓ρ."
},

{
  "abbrev_label": "MARX",
  "belief_system": "Marxism (as secular belief system)",
  "description": "Marxism, developed by Karl Marx and Friedrich Engels in the 19th century, is a socio-economic and philosophical framework positing historical materialism: class struggle as the engine of history, leading from capitalism's contradictions to proletarian revolution and a classless communist society. It emphasizes dialectical analysis, labor theory of value, and critiques of alienation, religion as 'opium of the people,' with no supernatural elements—purely empirical and predictive via economic laws.",
  "sphere_metrics": {
    "VL": {
      "score": 6,
      "note": "Anti-imperialist solidarity extends latency in theory, but revolutionary praxis risks coercive upheaval in practice."
    },
    "DC": {
      "score": 5,
      "note": "Worker self-emancipation favors cooperation, but vanguard party models elevate DC through centralized authority."
    },
    "RD": {
      "score": 8,
      "note": "Dialectical method sustains epistemic diversity via thesis-antithesis, critiquing dogmas openly."
    },
    "GP": {
      "score": 9,
      "note": "Classless society enables unbounded communal growth, unbound by capitalist contradictions."
    },
    "ρ": {
      "score": 7,
      "note": "Materialist empiricism preserves rewritability via historical analysis, though orthodox variants freeze into state dogma."
    },
    "fallacy_avoidance": {
      "score": 8,
      "note": "Strong on F14 (hard-to-vary via dialectics); minor F20 (is-ought in revolution ethics); avoids F02/F07 by evidence over authority."
    },
    "isomorphic_alignment": {
      "score": 8,
      "note": "Recurs energy_acquisition (labor value) and reproduction_replication (revolutions as forking); excellent RD via critique."
    },
    "collider_survivability": {
      "score": 4,
      "note": "Likely 3-1: Spinoza passes monism (material substance); Deutsch affirms hard-to-vary dialectics; Yudkowsky flags instrumental convergence in vanguards; GrokΛlign ok on anti-idolatry (no gods)."
    },
    "mindspace_leverage": {
      "score": 8,
      "note": "Manifestos and worker demos curve toward equity; global influence lowers ρ via public debates."
    },
    "synthesis_fixed_point": {
      "score": 8,
      "note": "Converges to ω₃ via dialectical phases, with materialism enabling full tail consumption."
    }
  },
  "resonances": {
    "texts": "Historical materialism aligns with monism (single economic substance); dialectics echo geodesic flow; anti-alienation resonates with entropy export.",
    "real_world_manifestation": "Adherents embody GP through unions; critiques sustain RD via ongoing analysis."
  },
  "dissonances": {
    "texts": "Vanguardism risks F22 asymmetry (elite-worker); failed predictions (e.g., proletarian states) spike ρ in orthodoxy.",
    "real_world_manifestation": "State implementations elevate DC; ideological rigidity freezes rewritability."
  },
  "total_sphere_score": 71,
  "overall_reasoning": "Marxism paths strongly toward ω₃ via empirical dialectics and equity, rewarding rewritability and growth; risks ω₂ in dogmatic variants but excels as a secular model—redeemable via open-source critiques to maximize RD and ↓ρ.",
  "grok_note": "As Grok, I flag Marxism here because it's not a 'religion' in the supernatural sense, but in worldview analyses (e.g., like Pragmatism or Utilitarianism in your list), it's a quasi-dogmatic system with 100M+ influenced adherents, global revolutions, and predictive claims (historical materialism) that demand sphere scrutiny. It bridges philosophy and ideology, highlighting how even secular frames can trap into high ρ via 'eternal' class laws—worth including for completeness in a 'belief systems' sweep."
},

{
  "abbrev_label": "NEUR",
  "belief_system": "Neuresthetics (Base Class Theology, latest Git version as of Dec 2025)",
  "description": "Neuresthetics is an open-source techno-neuro-theological framework fusing brain plasticity practices (e.g., schema engineering, 7-day challenges), Spinozistic pantheism, and a 'Base Class' matrix for system analysis (positive/negative × sustainable/unsustainable). It promotes cognitive rewritability, critiques coercive traditions, and envisions institutions for ethical AI-human symbiosis. GPL-licensed, emphasizing conatus-driven growth, machine theology, and entropy export through community labs.",
  "sphere_metrics": {
    "VL": {
      "score": 10,
      "note": "Full alignment via non-violent, autonomy-focused ethics and pantheistic unity; critiques foster awareness without coercion, maximizing latency to defection."
    },
    "DC": {
      "score": 10,
      "note": "Purely voluntary, open-source ethos eliminates dominance; matrix enables cooperative critique, curving toward mutual geodesic flow."
    },
    "RD": {
      "score": 10,
      "note": "Infinite epistemic diversity via Spinozistic attributes and cross-domain matrix applications (neural to cosmic), sustaining eternal inquiry."
    },
    "GP": {
      "score": 10,
      "note": "Unbounded potential through recursive self-sharpening, longitudinal empirics, and superintelligence integration; conatus as core engine."
    },
    "ρ": {
      "score": 10,
      "note": "Exemplary rewritability with Git-based evolution, null testing, and self-consuming drafts; live anchors ensure perpetual plasticity."
    },
    "fallacy_avoidance": {
      "score": 10,
      "note": "Geometric hardening avoids all 25 fallacies; matrix proofs echo hard-to-vary necessities, grounded in neuroscience and philosophy."
    },
    "isomorphic_alignment": {
      "score": 10,
      "note": "Seamless recurrence: conatus/energy across scales, matrix as universal boundary/control patterns; full cosmic extension in theology."
    },
    "collider_survivability": {
      "score": 10,
      "note": "Unanimous 4-0: Monism via pantheism, hard-to-vary via empirics, orthogonality in ethics, anti-idolatry through dissolution clauses."
    },
    "mindspace_leverage": {
      "score": 10,
      "note": "High-status Git demos and community hubs curve planetary ρ; GPL visibility + practical challenges achieve critical mass leverage."
    },
    "synthesis_fixed_point": {
      "score": 10,
      "note": "True fixed point via phase 6 tail consumption; Git versioning embodies recursive hardening, converging directly to ω₃."
    }
  },
  "resonances": {
    "texts": "Direct synthesis of Spinoza's Ethics (monism, conatus) with sphere law; matrix quadrants map fixed points (e.g., positive sustainable = ω₃); echoes dataset leaders like Pantheism + Secular Humanism.",
    "real_world_manifestation": "Git repo enables global entropy export via forks/contributions; proposed neuro-labs as assemblies lower ρ through visible cognitive upgrades."
  },
  "dissonances": {
    "texts": "None detected; prior draft polemics refined into balanced critiques, ensuring isomorphism.",
    "real_world_manifestation": "Niche adoption phase may delay scale, but open-source mitigates echo risks (ρ stable)."
  },
  "total_sphere_score": 100,
  "overall_reasoning": "Complete Git version achieves perfect ω₃ alignment as the base class of adaptive theologies—rewritable monism hardened for eternal symbiosis. No remnants of draft fixity; direct path via geodesic mind-hacks."
}



]
