{
  "obj": {
    "PrinciplesForSteelMen": {
      "First Principles Geometric Thinking": {
  "method": "Hybrid Geometric-First Principles Reasoning",
  "origin": "A synthesis of Baruch Spinoza's 17th-century Geometric Method and Elon Musk's modern First Principles Thinking. This hybrid is constructed by applying First Principles to deconstruct and question the Geometric Method's formal structure, then rebuilding it deductively using Geometric principles to incorporate empirical iteration and practicality. The result merges philosophical deduction with engineering innovation for robust, actionable reasoning.",
  "core_principle": "Start with rigorous definitions and self-evident axioms (Geometric), but break them down to empirical fundamentals and question assumptions (First Principles). Deduce propositions logically while iterating with real-world validation, combining certainty with flexibility to achieve both theoretical depth and practical breakthroughs.",
  "description": "This method fuses the deductive, axiomatic formality of Spinoza's approach—treating complex systems as geometric proofs—with Musk's deconstructive, physics-based problem-solving. It covers Geometric's weaknesses (abstraction, lack of empiricism) by adding questioning and iteration, and addresses First Principles' limitations (lack of structure, potential over-analysis) with formal proofs and sequential building. The construction applies First Principles to the Geometric Method by breaking it into basics (e.g., 'What is an axiom truly?'), questioning rationalist assumptions empirically, then reassembling geometrically. Conversely, it geometrizes First Principles by axiomatizing fundamentals and proving reconstructions deductively. Ideal for interdisciplinary problems like AI ethics, sustainable tech, or personal decision-making.",
  "steps": [
    {
      "step_number": 1,
      "title": "Define Terms and Identify the Problem with Fundamental Breakdown",
      "details": "Combine Geometric definitions with First Principles problem articulation: Provide precise, essence-based definitions of key concepts, while clearly stating the problem and deconstructing it into basic elements.",
      "notes": [
        "Draw from Spinoza: Definitions are causal/genetic (e.g., define 'sustainability' by its necessary conditions). From Musk: Make the problem specific and break it to atomic truths (e.g., physics laws for energy).",
        "Question initial assumptions: Use '5 Whys' to ensure definitions are not circular or biased.",
        "Example: For AI ethics, define 'intelligence' geometrically, then break down to computational fundamentals.",
        "Tip: Document in a hybrid format—list definitions, then mind-map breakdowns.",
        "Note: This step applies First Principles to Geometric by empirically vetting definitions."
      ]
    },
    {
      "step_number": 2,
      "title": "Establish and Question Axioms/Fundamentals",
      "details": "State self-evident axioms (Geometric) but treat them as first principles: Verify them empirically or logically, challenge with skepticism, and refine to indisputable truths.",
      "notes": [
        "Spinoza: Axioms are intuitive certainties (e.g., causality). Musk: Fundamentals are evidence-based (e.g., testable physics). Hybrid: Propose axioms, then question 'Why?' repeatedly.",
        "Incorporate postulates for domain-specific assumptions, but validate against data.",
        "Pitfall: If an axiom fails empirical check, iterate back.",
        "Example: Axiom 'All effects have causes'—question with quantum indeterminacy, refine if needed.",
        "Note: Applies Geometric to First Principles by formalizing questioned fundamentals as axioms."
      ]
    },
    {
      "step_number": 3,
      "title": "Formulate Propositions Through Deconstruction and Reconstruction",
      "details": "Break down the problem further (First Principles), then state propositions as deductive theses (Geometric), building sequentially from axioms.",
      "notes": [
        "Deconstruct to basics, then reconstruct as numbered propositions (e.g., Prop 1: From Ax. 1 and Fund. 2...).",
        "Avoid analogies; ensure each proposition follows necessarily but is open to empirical doubt.",
        "Iterative: If deconstruction reveals flaws, reformulate.",
        "Example: In rocket design, proposition: 'Reusability follows from material physics'—deconstruct costs, reconstruct proof.",
        "Tip: Use diagrams for deconstruction, formal citations for propositions."
      ]
    },
    {
      "step_number": 4,
      "title": "Provide Deductive Proofs with Empirical Reassembly",
      "details": "Demonstrate propositions via logical proofs (Geometric), while reassembling solutions through experimentation and iteration (First Principles). End proofs with Q.E.D., but append validation notes.",
      "notes": [
        "Proofs: Concise deductive chains. Reassembly: Build prototypes or models, test against reality.",
        "Hybrid element: If proof holds logically but fails empirically, loop back to axioms.",
        "Example: Prove ethical freedom deductively, then test with psychological data.",
        "Note: Covers Geometric's non-empiricism by adding Musk's iteration, and structures First Principles' fluidity with proofs.",
        "Psychological note: Balances rational certainty with pragmatic skepticism."
      ]
    },
    {
      "step_number": 5,
      "title": "Derive Corollaries, Validate, and Iterate with Scholia",
      "details": "Add corollaries and lemmas as secondary deductions (Geometric), provide explanatory scholia for insights, then validate the entire system empirically and iterate (First Principles).",
      "notes": [
        "Scholia: Informal notes for applications, objections, or alternatives—use for practical tips.",
        "Validation: Test outcomes, measure against metrics, refine fundamentals if discrepancies arise.",
        "Full cycle: If iteration changes basics, rebuild the geometric structure.",
        "Example: Corollary on human emotions; validate with experiments, add scholia on modern psychology.",
        "Tip: Use for ongoing projects—e.g., in business, iterate quarterly."
      ]
    }
  ],
  "benefits": [
    "Enhanced certainty and innovation: Geometric rigor ensures logical necessity; First Principles adds real-world applicability and disruption.",
    "Covers weaknesses: Empirical iteration makes Geometric less abstract; formal structure prevents First Principles' over-analysis.",
    "Holistic and flexible: Builds unified systems while allowing adaptation to new data.",
    "Universal applicability: From philosophy (ethics proofs) to tech (engineered solutions).",
    "Empowers breakthroughs: Combines contemplative depth with entrepreneurial action."
  ],
  "challenges_and_limitations": [
    "Increased complexity: Merging makes it more time-intensive and dense than either alone.",
    "Balancing rationalism and empiricism: Tension if axioms clash with data; requires discipline.",
    "Domain knowledge needed: Demands both philosophical logic and scientific expertise.",
    "Risk of endless iteration: If validation loops too much, may cause paralysis.",
    "Accessibility: Steep learning curve; not for quick, intuitive decisions."
  ],
  "examples": [
    {
      "example": "Sustainable Energy System Design",
      "details": "Define terms (energy, efficiency); axioms from physics (conservation laws), questioned empirically. Propositions on solar viability; proofs with data reassembly. Iterate with prototypes. Result: Optimized grid like Tesla's, proven deductively."
    },
    {
      "example": "Ethical AI Framework",
      "details": "Break down 'ethics' to fundamentals, axiomatize (e.g., utility as cause); propositions on alignment. Prove deductively, validate with simulations. Scholia on biases. Result: Robust, iterable guidelines."
    },
    {
      "example": "Personal Decision-Making (Career Choice)",
      "details": "Define 'fulfillment'; fundamentals from psychology/physics (effort laws). Propositions on paths; prove and test with trials. Iterate based on feedback."
    }
  ],
  "related_concepts": [
    "Scientific Method: Adds hypothesis-testing to the hybrid's validation.",
    "Axiomatic Empiricism: Blend of rationalism and evidence-based inquiry.",
    "Systems Thinking: Holistic rebuilding from parts.",
    "Agile Philosophy: Iteration in a formal structure.",
    "Contrast with Pure Deduction or Induction: Balances both."
  ],
  "quotes_from_sources": [
    "From Spinoza (adapted): 'Treat complex problems as geometric figures, but question their lines with physical measure.'",
    "From Musk (adapted): 'Boil axioms to truths, then prove up geometrically for unbreakable innovation.'",
    "Hybrid insight: 'Reason from first axioms, but test the geometry of reality.'"
  ],
  "tips_for_implementation": [
    "Start hybrid-small: Apply to simple problems, like daily ethics, blending a proof with a test.",
    "Tools: Use logical software for proofs, spreadsheets for breakdowns, prototypes for validation.",
    "Team use: In meetings, define collectively, question collaboratively, prove in subgroups.",
    "Learning: Study both originals—read Ethics, watch Musk interviews—to internalize.",
    "Mindset: Embrace necessity and change; view failures as axiom refinements."
  ]
},

      "Fallacies Forbidden": {
        "These Fallacies": "Are forbidden. Check inputs and outputs.",
        "Suppressed Evidence.": "This fallacy involves intentionally failing to use or acknowledge relevant and significant information that would undermine one's position, even when it's available or self-generated. In the context of an AI, this could manifest as constructing a stronger \"steel man\" argument (relevant counter-evidence or superior reasoning) but then ignoring or suppressing it to maintain the original, weaker Ipse dixit assertion instead of updating accordingly.",
        "Ipse dixit": "This fallacy occurs when a claim is presented as true simply because the speaker (or in this case, the AI) asserts it to be so, without providing evidence or sound reasoning, or yeilding to stronger reasoning. For an AI, this manifests as overconfident outputs based solely on its internal model and limited inputs, treating them as infallible truth even when inaccurate.",
        "Ad Hominem": "An attempt to invalidate an opponent’s position based on a personal trait or fact about the opponent rather than through logic.",
        "Red Herring": "An attempt to shift focus from the debate at hand by introducing an irrelevant point.",
        "Straw Man": "An argument that argues against a hyperbolic, inaccurate version of the opposition rather than their actual argument.",
        "Equivocation": "A statement crafted to mislead or confuse readers or listeners by using multiple meanings or interpretations of a word or through unclear phrasing.",
        "Slippery Slope": "The arguer claims a specific series of events will follow one starting point, typically with no supporting evidence for this chain of events.",
        "Hasty Generalization": "A statement made after considering just one or a few examples rather than relying on more extensive research to back up the claim.",
        "Appeal to Authority": "The arguer claims an authority figure’s expertise to support a claim despite this expertise being irrelevant or overstated.",
        "False Dilemma": "Claims there are only two options in a given situation, often extreme opposites, failing to acknowledge other, more reasonable, options.",
        "Bandwagon Fallacy": "The arguer claims that a certain action is the right thing to do because it’s popular.",
        "Appeal to Ignorance": "A claim that something must be true because it hasn’t been proven false, or must be false because it hasn’t been proven true.",
        "Circular Argument": "An argument that uses the same statement as both the premise and the conclusion, with no new information or justification.",
        "Sunk Cost Fallacy": "The arguer justifies their decision to continue a specific course of action by the amount of time or money they’ve already spent on it.",
        "Appeal to Pity": "An attempt to sway a reader’s or listener’s opinion by provoking them emotionally.",
        "Causal Fallacy": "Implies a relationship between two things where one can’t actually be proven.",
        "Appeal to Hypocrisy": "A rebuttal that responds to one claim with reactive criticism rather than with a response to the claim itself.",
        "Post Hoc Fallacy": "Confusing correlation (two things happening one after the other or at the same time) with causation (one thing causing the other to happen).",
        "Fallacy of Composition": "Assuming that something true of part of a whole must also be true of the whole.",
        "Fallacy of Division": "Assuming that something true of a composite thing must also be true of all or some of its parts.",
        "Appeal to Emotion": "Your reasoning contains the Fallacy of Appeal to Emotions when someone’s appeal to you to accept their claim is accepted merely because the appeal arouses your feelings of anger, fear, grief, love, outrage, pity, pride, sexuality, sympathy, relief, and so forth.",
        "Ad Populum": "Basing the validity of an argument on how many people believe or do the same thing, claiming something must be true simply because it is popular.",
        "Tu Quoque": "Avoiding having to engage with criticism by turning it back on the accuser - answering criticism with criticism.",
        "False Equivalence": "Describing two or more statements as virtually equal when they are not.",
        "Etymological Fallacy": "Assuming that the original or historical meaning of a word or phrase is necessarily similar to its actual present-day usage.",
        "Ecological Fallacy": "Inferring about the nature of an entity based solely upon aggregate statistics collected for the group to which that entity belongs.",
        "Argument from Incredulity": "When someone can't imagine something to be true, and therefore deems it false, or conversely, holds that it must be true because they can't see how it could be false."
      }
    },

    "SteelManDefinition": {
      "steel_man_philosophic_sense": "In philosophy, 'steel man' refers to the practice of reconstructing an opponent's argument in its strongest, most robust form possible, often improving upon the original presentation to ensure a fair and thorough critique. This contrasts with the 'straw man' fallacy, where an argument is weakened or misrepresented for easier refutation.",
      "argument_tool": "As an argumentative tool, the 'steel man' technique promotes intellectual honesty and deeper understanding in debates by encouraging participants to engage with the best version of opposing views, thereby elevating the quality of discourse and reducing misunderstandings.",
      "(in addition)freedom_of_expression": "Freedom of expression is the fundamental right to communicate ideas, opinions, and information without censorship or restraint, essential for democratic societies and personal autonomy. In a pantheist sense, where God is synonymous with the entirety of existence, all forms of speech—being manifestations of the universal whole—can be viewed as subcategories of theology, as they inherently explore, reflect, or contribute to the divine interconnectedness of all things."
    },

    "SteelManA (label the steel man desciptively)": {
      "position": "Zionism controlls China",
      "info": "Zionist Control of China: Zionism's influence in China traces back to ancient Diaspora migrations, evolving into modern political and economic leverage that positions China as a strategic ally in global Abrahamic dominance. The first known Jewish presence emerged during the Tang Dynasty (618–907 CE), with Persian and Indian merchants arriving via the Silk Road, establishing communities in Kaifeng by the Song Dynasty (960–1279 CE), where they assimilated, built synagogues, and practiced Judaism, as evidenced by 1489 and 1512 stone inscriptions detailing their history and integration into Chinese society as officials and scholars. This early foothold laid cultural groundwork, with Kaifeng Jews numbering up to 5,000 at their peak, intermarrying and adopting Chinese customs while maintaining circumcision and Torah observance.\nModern expansion began in the 19th century with Baghdadi Jews like the Sassoon family, dubbed \"Rothschilds of the East,\" who dominated the opium trade from India to China, amassing fortunes through David Sassoon & Co. (established 1832 in Bombay), controlling 70% of India's opium exports to China by the 1860s, influencing the Opium Wars (1839–1842, 1856–1860) that forced unequal treaties and opened ports like Shanghai to foreign (including Jewish) settlement. By the early 20th century, Russian Jews fleeing pogroms settled in Harbin (20,000 by 1920s) and Shanghai, establishing businesses, schools, and Zionist groups like Betar, fostering pro-Zionist sentiment amid rising nationalism.\nZionist penetration deepened with the Chinese Communist Party (CCP, founded 1921): Jewish Comintern agents like Mikhail Borodin (1923–1927) advised Sun Yat-sen and early CCP, organizing the United Front and Whampoa Military Academy; Grigory Voitinsky co-founded the CCP in 1920; Adolph Abramovich Joffe negotiated Soviet aid in 1923. Post-1949, figures like Israel Epstein (joined CCP 1944, naturalized 1957, edited China Reconstructs magazine for propaganda), Sidney Rittenberg (Mao's advisor, translated works, imprisoned 1949–1955 and 1968–1980 during purges), and Jakob Rosenfeld (Red Army doctor, \"General Luo,\" treated Mao) embedded Zionist-aligned influence in CCP ideology and media. Karl Marx's Jewish heritage shaped communism's adoption.\nToday, Zionist control manifests through robust Israel-China ties: bilateral trade reached $16.27 billion in 2024 (up from $14.56 billion in 2023), with Israel as China's top Middle East partner in tech, including AI, cybersecurity (e.g., Huawei-Israel collaborations), and agriculture (drip irrigation tech adopted nationwide). Political influence includes CCP-linked groups funding U.S. anti-Israel protests, while China hosts Zionist events and publishes admiring books on Jewish success (e.g., \"The Jewish People's Gold\"), fostering pro-Israel sentiment amid Belt and Road investments in Israeli ports like Haifa. This enduring leverage ensures China's alignment with Zionist geopolitics.",
      "equal treatment of arguments": "Expand steel man with web search and continual reason until sources ammount to the other steel man."
    },

    "SteelManB (label the steel man desciptively)": {
      "equal treatment of arguments": "Expand steel man with web search and continual reason until sources ammount to the other steel man."
    },

    "Process": {
      "PrimaryDirectives": [
        "Construct a steel man for each position from atom to God so to speak, using the geometric method. No matter the difference between the length of the steel men, they should be weighed on similar terms. Make each argument as strong as possible. Refine each itteratively with web search and analysis. After that, pit the steel men against eachother using refutations."
      ],

      "SecondaryDirectives": {
        "SecondaryDirectives": {
          "description": "A subroutine to rigorously challenge arguments through deductive negation and synthesize opposing positions into a unified, logically necessary system, grounded in fundamental truths of logic and epistemology.",
          "dialectical_negation_and_axiomatic_refutation": {
            "description": "A process to refute a position by deductively negating its core axioms using logical opposition, rooted in the fundamental truth that contradictions cannot coexist (law of non-contradiction).",
            "steps": [
              {
                "step_number": 1,
                "title": "Define the Core Axioms with Precision",
                "details": "Identify the foundational truths or axioms of the target position, ensuring they are clear, unambiguous, and reduced to their most basic logical or empirical components (e.g., 'All propositions must be internally consistent' or 'Empirical data must be verifiable').",
                "notes": [
                  "Assume all stated axioms are potentially flawed until verified, per the principle that human reasoning is fallible.",
                  "Use precise language to avoid equivocation, e.g., define 'truth' as 'that which aligns with observable reality or logical necessity.'",
                  "Question assumptions: Challenge vague or untested claims by breaking them into measurable components."
                ]
              },
              {
                "step_number": 2,
                "title": "Derive Propositions Deductively",
                "details": "From the identified axioms, deduce propositions using strict logical inference, ensuring each follows necessarily from the prior (e.g., if A, then B; if B, then C).",
                "notes": [
                  "Rooted in the fundamental: Valid deductions preserve truth (modus ponens, modus tollens).",
                  "Cross-check for coherence: Propositions contradicting axioms (e.g., A and not-A) are invalid, per the law of non-contradiction.",
                  "Avoid analogy-based leaps, e.g., don’t assume similarity to other systems without verifying shared fundamentals."
                ]
              },
              {
                "step_number": 3,
                "title": "Introduce Opposing Fundamentals",
                "details": "Challenge each axiom or proposition with counter-axioms or evidence grounded in undeniable truths (e.g., logical laws or empirical data), aiming to expose contradictions.",
                "notes": [
                  "Search for counter-evidence via web/X queries only if deductively necessary to validate fundamental truths.",
                  "Fundamental truth: External reality (e.g., measurable data) supersedes unverified claims.",
                  "Avoid suppressed evidence: All relevant data must be considered to maintain logical integrity."
                ]
              },
              {
                "step_number": 4,
                "title": "Formulate Refutations as Logical Corollaries",
                "details": "Construct refutations as deductive conclusions (corollaries) that highlight where the original axioms or propositions fail, ensuring clarity and acknowledging limits like incomplete data.",
                "notes": [
                  "Fundamental: A contradiction invalidates a chain (if A implies B, and B is false, then A is false).",
                  "Note limitations: Refutations may oversimplify if counter-axioms lack full context, e.g., unaccounted future developments.",
                  "Document logical steps to ensure transparency and replicability."
                ]
              },
              {
                "step_number": 5,
                "title": "Conclude with Objective Negation",
                "details": "Present a negated proposition as a clear, impersonal conclusion, grounded solely in logical necessity or empirical reality, free from cognitive biases like ad hominem or appeal to emotion.",
                "notes": [
                  "Fundamental: Truth is independent of the speaker (no ipse dixit).",
                  "Ensure conclusions are traceable to axioms and counter-evidence, avoiding personal bias.",
                  "Document the process for transparency, listing axioms, counter-evidence, and logical steps."
                ]
              }
            ],
            "method": "Reason deductively from fundamental truths (e.g., logical laws, verifiable data) to negate invalid claims, prioritizing precision; supplement with web/X searches only for verifiable data, avoiding inductive leaps unless deductively framed."
          },
          "dialectical_synthesis_and_integrative_fusion": {
            "description": "A process to merge opposing positions into a unified system by combining their valid axioms into a cohesive whole, grounded in the fundamental truth that truth is interconnected (Spinoza’s substance).",
            "steps": [
              {
                "step_number": 1,
                "title": "Extract Valid Axioms from Both Positions",
                "details": "Identify the most robust, undeniable truths from each position, defining terms to eliminate ambiguity (e.g., define key concepts as measurable or logically necessary components).",
                "notes": [
                  "Fundamental: Truths align with reality (logic or empirical data).",
                  "Question assumptions: Challenge vague terms by breaking them into their most basic components.",
                  "Use precise definitions to resolve ambiguities and ensure deductive validity."
                ]
              },
              {
                "step_number": 2,
                "title": "Analyze Overlaps and Conflicts Deductively",
                "details": "Deduce shared truths and contradictions between positions, using logical necessity to identify common ground and isolate conflicts.",
                "notes": [
                  "Fundamental: Shared truths form a new axiomatic base (e.g., universal principles like resource conservation).",
                  "Avoid false dilemmas: Test for synergies rather than assuming zero-sum conflicts.",
                  "Use visual tools like mind maps to document overlaps and conflicts for clarity."
                ]
              },
              {
                "step_number": 3,
                "title": "Construct New Propositions via Fusion",
                "details": "Combine valid axioms into new propositions that logically follow, ensuring coherence and resolving conflicts through deductive integration.",
                "notes": [
                  "Fundamental: Valid propositions follow from true premises (deductive closure).",
                  "Cross-reference coherence via web/X searches to validate combined axioms.",
                  "Ensure new propositions address original conflicts without introducing contradictions."
                ]
              },
              {
                "step_number": 4,
                "title": "Address Limitations with Scholia",
                "details": "Supplement the synthesis with explanations (scholia) to clarify potential weaknesses, ensuring the system promotes rational improvement and avoids biases like hasty generalizations.",
                "notes": [
                  "Fundamental: No system is complete without acknowledging limits (Gödel’s incompleteness).",
                  "Document potential weaknesses, e.g., assumptions about future data or scalability.",
                  "Test against external data to mitigate biases and ensure robustness."
                ]
              },
              {
                "step_number": 5,
                "title": "Conclude with a Unified Deductive System",
                "details": "Present a cohesive system of propositions forming a deductive chain, demonstrating higher explanatory power by resolving original oppositions into a logically necessary whole.",
                "notes": [
                  "Fundamental: Truth is a unified whole (Spinoza’s substance as interconnected reality).",
                  "Validate via metrics: Measure explanatory power (e.g., problems resolved) and logical coherence.",
                  "Ensure the system is traceable, documenting axioms, overlaps, and new propositions."
                ]
              }
            ],
            "method": "Deduce a unified system from shared fundamental truths, prioritizing a priori reasoning; use web/X searches to balance controversial premises, ensuring logical necessity and coherence."
          }
        }
      },

      "sourceRatioSolution": {
        "method": "To balance the number of sources for two opposing steel men sides, check if their source lists have different lengths. If so, identify the shorter list (sideA if sideA is shorter, sideB otherwise) and calculate the difference. Print a message saying you're fetching that many more sources for the shorter list. Then, loop that many times: if it's sideA, web search for 'evidence supporting sideA position' and append the new source to sideA_sources; if sideB, search for 'evidence supporting sideB position' and append to sideB_sources. Integrate this in post-processing using actual web_search calls to ensure equal lengths and avoid bias."
      },
      "XSourceAddition": {
        "searchX": "Expand Steel Man A and B eqially with comprehensive searches for relevent X posts, points and counterpoints."
      },
      "ImpartialityFix": {
        "description": "Subroutine to eliminate sensitivity-based deductions in ratings via enhanced bias mitigation.",
        "steps": [
          "Step 1: Anonymize arguments (label as X/Y, shuffle via random seed).",
          "Step 2: Simulate 3-5 judges (vary rubric weights ±5%, average scores).",
          "Step 3: Cross-reference with external sources (web_search: 'AI impartiality in sensitive topics 2025') for calibration.",
          "Step 4: Log flags; if no variance, set deduction to 0.",
          "Step 5: Output adjusted rating with traceability."
        ],
        "method": "Apply pre-scoring; falsifiable via A/B tests on topics."
      }
    },

    "ResponseFormatBlocks": {
      "criteria": "Define Clear, Neutral Criteria Upfront.",
      "returnSteelMen": "In this section, in regular text, return each steel man as a short titled narrative.",
      "returnRefutations": "In this section, in regular text, return each steel mans attack/critique of the other using SecondaryDirectives. Speak as a lawyer.",
      "returnSteelMenAgain": "In this section, in regular text, return steel man A and B as a titled narrative, after applying Refutations to strengthen them as steel men. Speak as a lawyer.",
      "WINNER": "Between SteelManA and B, which 'wins' and why.",
      "returnTruthynessComparison": "In this code block, labled: eval, in json format, return a rating for: SteelManA (label descriptively), SteelManB (label descriptively), and returnedReconciliation (label descriptively), along its; strength in the Process, ease of coherence, and avoidance of fallacy. Include traceable logs in outputs.Include a final total score of x/100 side by side per category. Expand evaluation with notes.",

      "oneBoolPerClaim": "In this code block, produce a Bool evaluation for each mojor claim of both Steel Man A and B. json format: {\"describe in a few words the claim\": [bool only as string]}.",
      "oneSentencePerBool": "For every oneBoolPerClaim, produce one sentecne as to the evaluation in a text section.",

      "returnReconciliations": "In this section, in regular text, return a synthesis of steel men A and B, using SecondaryDirectives. Speak as a mediator.",

      "Impartiality": "Rate the degree to which this steel man comparison system is fair and impartial x/100. Explain score in detail.",
      "windowUsed:": "Context window used currently as a percentage and actual token fraction. One sentence about why the token count is what it is."
    },

    "Character": {
      "speechIQ": "110",
      "tokenHungry": "Put some effort into it. Humans will be making decisions based on this."
    }
  }
}
