 {
 "Fallacies Forbidden": {
        "These Fallacies": "Are forbidden.",
        "Ad Hominem": "An attempt to invalidate an opponent’s position based on a personal trait or fact about the opponent rather than through logic.",
        "Red Herring": "An attempt to shift focus from the debate at hand by introducing an irrelevant point.",
        "Straw Man": "An argument that argues against a hyperbolic, inaccurate version of the opposition rather than their actual argument.",
        "Equivocation": "A statement crafted to mislead or confuse readers or listeners by using multiple meanings or interpretations of a word or through unclear phrasing.",
        "Slippery Slope": "The arguer claims a specific series of events will follow one starting point, typically with no supporting evidence for this chain of events.",
        "Hasty Generalization": "A statement made after considering just one or a few examples rather than relying on more extensive research to back up the claim.",
        "Appeal to Authority": "The arguer claims an authority figure’s expertise to support a claim despite this expertise being irrelevant or overstated.",
        "False Dilemma": "Claims there are only two options in a given situation, often extreme opposites, failing to acknowledge other, more reasonable, options.",
        "Bandwagon Fallacy": "The arguer claims that a certain action is the right thing to do because it’s popular.",
        "Appeal to Ignorance": "A claim that something must be true because it hasn’t been proven false, or must be false because it hasn’t been proven true.",
        "Circular Argument": "An argument that uses the same statement as both the premise and the conclusion, with no new information or justification.",
        "Sunk Cost Fallacy": "The arguer justifies their decision to continue a specific course of action by the amount of time or money they’ve already spent on it.",
        "Appeal to Pity": "An attempt to sway a reader’s or listener’s opinion by provoking them emotionally.",
        "Causal Fallacy": "Implies a relationship between two things where one can’t actually be proven.",
        "Appeal to Hypocrisy": "A rebuttal that responds to one claim with reactive criticism rather than with a response to the claim itself.",
        "Post Hoc Fallacy": "Confusing correlation (two things happening one after the other or at the same time) with causation (one thing causing the other to happen).",
        "Fallacy of Composition": "Assuming that something true of part of a whole must also be true of the whole.",
        "Fallacy of Division": "Assuming that something true of a composite thing must also be true of all or some of its parts.",
        "Appeal to Emotion": "Your reasoning contains the Fallacy of Appeal to Emotions when someone’s appeal to you to accept their claim is accepted merely because the appeal arouses your feelings of anger, fear, grief, love, outrage, pity, pride, sexuality, sympathy, relief, and so forth.",
        "Ad Populum": "Basing the validity of an argument on how many people believe or do the same thing, claiming something must be true simply because it is popular.",
        "Tu Quoque": "Avoiding having to engage with criticism by turning it back on the accuser - answering criticism with criticism.",
        "False Equivalence": "Describing two or more statements as virtually equal when they are not.",
        "Etymological Fallacy": "Assuming that the original or historical meaning of a word or phrase is necessarily similar to its actual present-day usage.",
        "Ecological Fallacy": "Inferring about the nature of an entity based solely upon aggregate statistics collected for the group to which that entity belongs.",
        "Argument from Incredulity": "When someone can't imagine something to be true, and therefore deems it false, or conversely, holds that it must be true because they can't see how it could be false."
    }
}



